------------------------------------------------------------------------------
       log:  c:\www\econ626\stata\card_et_al.log
  log type:  text
 opened on:  26 Sep 2006, 13:52:26

. *read in raw data;
. use card_et_al;

. * get list of variables;
. describe;

Contains data from card_et_al.dta
  obs:        46,950                          
 vars:            14                          21 Aug 2006 08:28
 size:     2,817,000 (93.3% of memory free)
------------------------------------------------------------------------------
> -
              storage  display     value
variable name   type   format      label      variable label
------------------------------------------------------------------------------
> -
educ_r1         float  %9.0g                  education recode, 1=<8, 8=adv
                                                degree
phstat          float  %9.0g                  self reported health,
                                                5=excellent, 1=poor
age_qtr         float  %9.0g                  age in quarters
age_yrs         float  %9.0g                  age in years
black           float  %9.0g                  =1 if black, =otherwise
delayed_med     float  %9.0g                  has delayed medical care
                                                because of cost
hispanic        float  %9.0g                  =1 if hispanic, =0 otherwise
hosp_12m        float  %9.0g                  ever hospitalized past 12 months
insured         float  %9.0g                  =1 if has health insurance, =0
                                                otherwise
male            float  %9.0g                  =1 if male, =0 female
md_2wks         float  %9.0g                  visited doctor past 2 weeks
not_get_med     float  %9.0g                  have not received care because
                                                of cost
white           float  %9.0g                  =1 if white, 0=otherwise
year            float  %9.0g                  year of survey
------------------------------------------------------------------------------
> -
Sorted by:  

. * get tables of self reported health status;
. tab phstat;

       self |
   reported |
    health, |
5=excellent |
   , 1=poor |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      8,131       17.32       17.32
          2 |     12,613       26.86       44.18
          3 |     15,241       32.46       76.65
          4 |      7,800       16.61       93.26
          5 |      3,165        6.74      100.00
------------+-----------------------------------
      Total |     46,950      100.00

. * generate some new variables;
. gen good_health=phstat<4;

. label var good_health "=1 if report,good,vgood,excel health";

. * eligible for Medicare after quarter 259;
. gen age65=age_qtr>259;

. * scale the age in quarters index so that it equals 0;
. * in the month you become eligible for Medicare;
. gen index=age_qtr-260;

. gen index2=index*index;

. gen index3=index*index*index;

. gen index4=index2*index2;

. gen index_age65=index*age65;

. gen index2_age65=index2*age65;

. gen index3_age65=index3*age65;

. gen index4_age65=index4*age65;

. xi i.educ_r1 i.year i.age_qtr;
i.educ_r1         _Ieduc_r1_1-8       (naturally coded; _Ieduc_r1_1 omitted)
i.year            _Iyear_1998-2001    (naturally coded; _Iyear_1998 omitted)
i.age_qtr         _Iage_qtr_220-299   (naturally coded; _Iage_qtr_220 omitted)

. * 1st stage results. Impact of Medicare on insurance coverage;
. * basic results in the paper.  quadratic in age interacted with;
. * age65;
. reg insured male white black hispanic _Ie* _Iyear* index index2 index_age65 
> index2_age65 age65, cluster(index);

Regression with robust standard errors                 Number of obs =   46950
                                                       F( 19,    79) =  189.08
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0953
Number of clusters (index) = 80                        Root MSE      =  .25994

------------------------------------------------------------------------------
             |               Robust
     insured |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0077525   .0026721     2.90   0.005     .0024337    .0130712
       white |    .039912   .0074113     5.39   0.000     .0251602    .0546637
       black |    .004996   .0082919     0.60   0.549    -.0115087    .0215007
    hispanic |   .0999943   .0074106    13.49   0.000     .0852438    .1147447
 _Ieduc_r1_2 |   .0477623   .0079406     6.01   0.000      .031957    .0635676
 _Ieduc_r1_3 |   .0851812   .0100318     8.49   0.000     .0652133     .105149
 _Ieduc_r1_4 |   .0780332   .0113302     6.89   0.000     .0554811    .1005854
 _Ieduc_r1_5 |   .0970506   .0108434     8.95   0.000     .0754674    .1186338
 _Ieduc_r1_6 |    .101996   .0112541     9.06   0.000     .0795952    .1243968
 _Ieduc_r1_7 |   .1109833   .0139559     7.95   0.000     .0832049    .1387618
 _Ieduc_r1_8 |   .1124369   .0122111     9.21   0.000     .0881312    .1367426
 _Iyear_1999 |   -.000224   .0032407    -0.07   0.945    -.0066744    .0062264
 _Iyear_2000 |  -.0079039   .0033704    -2.35   0.022    -.0146124   -.0011953
 _Iyear_2001 |  -.0002411   .0031174    -0.08   0.939    -.0064461    .0059638
       index |   .0008314   .0006618     1.26   0.213    -.0004858    .0021486
      index2 |   .0000103   .0000163     0.64   0.526     -.000022    .0000427
 index_age65 |   .0009125   .0009527     0.96   0.341    -.0009838    .0028088
index2_age65 |  -.0000391   .0000223    -1.75   0.083    -.0000834    5.27e-06
       age65 |   .0910622   .0085334    10.67   0.000     .0740769    .1080474
       _cons |   .6820244   .0164487    41.46   0.000      .649284    .7147647
------------------------------------------------------------------------------

. * estimate same model but do not cluster on index. notice the drop in the st
> d errors on ag65;
. reg insured male white black hispanic _Ie* _Iyear* index index2 index_age65 
> index2_age65 age65;

      Source |       SS       df       MS              Number of obs =   46950
-------------+------------------------------           F( 19, 46930) =  260.17
       Model |  334.010957    19  17.5795241           Prob > F      =  0.0000
    Residual |   3170.9949 46930  .067568611           R-squared     =  0.0953
-------------+------------------------------           Adj R-squared =  0.0949
       Total |  3505.00586 46949  .074655602           Root MSE      =  .25994

------------------------------------------------------------------------------
     insured |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0077525   .0024253     3.20   0.001     .0029988    .0125062
       white |    .039912   .0053348     7.48   0.000     .0294557    .0503682
       black |    .004996   .0063545     0.79   0.432    -.0074589     .017451
    hispanic |   .0999943    .003956    25.28   0.000     .0922405     .107748
 _Ieduc_r1_2 |   .0477623   .0045912    10.40   0.000     .0387636    .0567611
 _Ieduc_r1_3 |   .0851812   .0040895    20.83   0.000     .0771657    .0931966
 _Ieduc_r1_4 |   .0780332   .0082227     9.49   0.000     .0619167    .0941498
 _Ieduc_r1_5 |   .0970506   .0046304    20.96   0.000      .087975    .1061262
 _Ieduc_r1_6 |    .101996   .0065035    15.68   0.000      .089249     .114743
 _Ieduc_r1_7 |   .1109833   .0088811    12.50   0.000     .0935763    .1283904
 _Ieduc_r1_8 |   .1124369   .0050158    22.42   0.000     .1026059    .1222678
 _Iyear_1999 |   -.000224   .0034016    -0.07   0.947    -.0068912    .0064432
 _Iyear_2000 |  -.0079039   .0033842    -2.34   0.020     -.014537   -.0012708
 _Iyear_2001 |  -.0002411   .0033937    -0.07   0.943    -.0068928    .0064105
       index |   .0008314   .0005825     1.43   0.153    -.0003102     .001973
      index2 |   .0000103   .0000137     0.76   0.449    -.0000164    .0000371
 index_age65 |   .0009125   .0008376     1.09   0.276    -.0007292    .0025542
index2_age65 |  -.0000391   .0000204    -1.91   0.056    -.0000791    9.55e-07
       age65 |   .0910622   .0072477    12.56   0.000     .0768565    .1052678
       _cons |   .6820244   .0079575    85.71   0.000     .6664276    .6976211
------------------------------------------------------------------------------

. * run unrestricted model that has dummies for all quarters instead of polyno
> mial;
. * use for test in card/lee, equation (3);
. reg insured male white black hispanic _Ie* _Iyear* _Iage*;

      Source |       SS       df       MS              Number of obs =   46950
-------------+------------------------------           F( 93, 46856) =   54.01
       Model |   339.36356    93  3.64907053           Prob > F      =  0.0000
    Residual |   3165.6423 46856  .067561087           R-squared     =  0.0968
-------------+------------------------------           Adj R-squared =  0.0950
       Total |  3505.00586 46949  .074655602           Root MSE      =  .25993

------------------------------------------------------------------------------
     insured |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0079442   .0024272     3.27   0.001     .0031869    .0127014
       white |   .0402223   .0053383     7.53   0.000     .0297591    .0506855
       black |   .0049628   .0063597     0.78   0.435    -.0075022    .0174278
    hispanic |   .1000732   .0039587    25.28   0.000     .0923142    .1078323
 _Ieduc_r1_2 |   .0476514   .0045938    10.37   0.000     .0386475    .0566553
 _Ieduc_r1_3 |   .0850489   .0040927    20.78   0.000     .0770271    .0930707
 _Ieduc_r1_4 |   .0778886   .0082283     9.47   0.000     .0617611    .0940161
 _Ieduc_r1_5 |   .0970998   .0046326    20.96   0.000     .0880198    .1061799
 _Ieduc_r1_6 |   .1017956   .0065088    15.64   0.000     .0890383    .1145529
 _Ieduc_r1_7 |   .1102532   .0088885    12.40   0.000     .0928316    .1276748
 _Ieduc_r1_8 |    .112422   .0050191    22.40   0.000     .1025845    .1222595
 _Iyear_1999 |  -.0002947   .0034044    -0.09   0.931    -.0069673    .0063779
 _Iyear_2000 |  -.0076742   .0033864    -2.27   0.023    -.0143116   -.0010368
 _Iyear_2001 |  -.0001359   .0033959    -0.04   0.968     -.006792    .0065202
_Iage_qt~221 |  -.0397855   .0152203    -2.61   0.009    -.0696175   -.0099535
_Iage_qt~222 |  -.0291178   .0151014    -1.93   0.054    -.0587167    .0004812
_Iage_qt~223 |  -.0171737   .0152446    -1.13   0.260    -.0470534     .012706
_Iage_qt~224 |  -.0321578   .0150947    -2.13   0.033    -.0617437   -.0025719
_Iage_qt~225 |  -.0278347   .0151803    -1.83   0.067    -.0575884     .001919
_Iage_qt~226 |  -.0087869   .0153302    -0.57   0.567    -.0388343    .0212605
_Iage_qt~227 |  -.0448496   .0153346    -2.92   0.003    -.0749057   -.0147935
_Iage_qt~228 |  -.0349252   .0152379    -2.29   0.022    -.0647917   -.0050587
_Iage_qt~229 |  -.0136322   .0152052    -0.90   0.370    -.0434345    .0161701
_Iage_qt~230 |  -.0269777   .0155877    -1.73   0.084    -.0575299    .0035744
_Iage_qt~231 |   -.028548   .0154602    -1.85   0.065    -.0588503    .0017542
_Iage_qt~232 |  -.0435742   .0153098    -2.85   0.004    -.0735816   -.0135667
_Iage_qt~233 |  -.0165693   .0154886    -1.07   0.285    -.0469271    .0137886
_Iage_qt~234 |   .0022251   .0155711     0.14   0.886    -.0282946    .0327447
_Iage_qt~235 |  -.0311202   .0157084    -1.98   0.048    -.0619089   -.0003315
_Iage_qt~236 |  -.0300989   .0156215    -1.93   0.054    -.0607173    .0005194
_Iage_qt~237 |  -.0083771   .0157676    -0.53   0.595    -.0392819    .0225277
_Iage_qt~238 |  -.0183119   .0157433    -1.16   0.245    -.0491691    .0125452
_Iage_qt~239 |  -.0197613   .0156539    -1.26   0.207    -.0504431    .0109205
_Iage_qt~240 |  -.0290279   .0157293    -1.85   0.065    -.0598576    .0018018
_Iage_qt~241 |  -.0342431   .0157649    -2.17   0.030    -.0651426   -.0033437
_Iage_qt~242 |  -.0197329   .0159546    -1.24   0.216    -.0510042    .0115384
_Iage_qt~243 |  -.0135571   .0160544    -0.84   0.398     -.045024    .0179097
_Iage_qt~244 |  -.0054044   .0157212    -0.34   0.731    -.0362182    .0254093
_Iage_qt~245 |   .0070893   .0163814     0.43   0.665    -.0250184    .0391971
_Iage_qt~246 |  -.0227024   .0161926    -1.40   0.161      -.05444    .0090352
_Iage_qt~247 |  -.0378912   .0160437    -2.36   0.018    -.0693371   -.0064452
_Iage_qt~248 |  -.0332465   .0158956    -2.09   0.036    -.0644021   -.0020908
_Iage_qt~249 |  -.0278253   .0160699    -1.73   0.083    -.0593225    .0036719
_Iage_qt~250 |  -.0100128   .0159354    -0.63   0.530    -.0412465    .0212209
_Iage_qt~251 |  -.0199791   .0162447    -1.23   0.219     -.051819    .0118607
_Iage_qt~252 |  -.0283497   .0160135    -1.77   0.077    -.0597363    .0030369
_Iage_qt~253 |   .0061935   .0163216     0.38   0.704    -.0257972    .0381841
_Iage_qt~254 |  -.0154447   .0160453    -0.96   0.336    -.0468937    .0160042
_Iage_qt~255 |  -.0271857   .0162688    -1.67   0.095    -.0590728    .0047013
_Iage_qt~256 |     .00283    .016216     0.17   0.861    -.0289536    .0346136
_Iage_qt~257 |   .0017181   .0162935     0.11   0.916    -.0302174    .0336536
_Iage_qt~258 |  -.0150662   .0159316    -0.95   0.344    -.0462923    .0161599
_Iage_qt~259 |  -.0157848   .0159476    -0.99   0.322    -.0470423    .0154728
_Iage_qt~260 |   .0533322   .0161169     3.31   0.001     .0217428    .0849217
_Iage_qt~261 |   .0870921   .0160814     5.42   0.000     .0555724    .1186119
_Iage_qt~262 |   .0890915   .0161731     5.51   0.000      .057392    .1207911
_Iage_qt~263 |   .0848871   .0163048     5.21   0.000     .0529295    .1168447
_Iage_qt~264 |   .0894104   .0163275     5.48   0.000     .0574083    .1214126
_Iage_qt~265 |   .1022092   .0163963     6.23   0.000     .0700723    .1343461
_Iage_qt~266 |   .1004596   .0164838     6.09   0.000     .0681511    .1327681
_Iage_qt~267 |    .100485   .0163706     6.14   0.000     .0683984    .1325715
_Iage_qt~268 |   .0965153    .016502     5.85   0.000     .0641713    .1288594
_Iage_qt~269 |   .1017353   .0165764     6.14   0.000     .0692453    .1342253
_Iage_qt~270 |   .1054595    .016333     6.46   0.000     .0734465    .1374725
_Iage_qt~271 |   .0934016   .0164654     5.67   0.000     .0611292    .1256739
_Iage_qt~272 |   .0868321   .0166663     5.21   0.000     .0541659    .1194984
_Iage_qt~273 |   .1036598   .0166447     6.23   0.000      .071036    .1362837
_Iage_qt~274 |   .0970238   .0163724     5.93   0.000     .0649337    .1291138
_Iage_qt~275 |   .0990205   .0164318     6.03   0.000      .066814     .131227
_Iage_qt~276 |   .1077617   .0165039     6.53   0.000     .0754138    .1401096
_Iage_qt~277 |    .111966   .0166456     6.73   0.000     .0793404    .1445916
_Iage_qt~278 |   .1074812    .016505     6.51   0.000     .0751312    .1398312
_Iage_qt~279 |   .1012854   .0165458     6.12   0.000     .0688553    .1337155
_Iage_qt~280 |   .0954181   .0166669     5.73   0.000     .0627508    .1280855
_Iage_qt~281 |   .1028325   .0164766     6.24   0.000     .0705381    .1351269
_Iage_qt~282 |   .1055271   .0164877     6.40   0.000      .073211    .1378433
_Iage_qt~283 |   .1094932   .0163822     6.68   0.000     .0773839    .1416025
_Iage_qt~284 |   .1026936   .0166122     6.18   0.000     .0701334    .1352537
_Iage_qt~285 |    .110236    .016725     6.59   0.000     .0774548    .1430173
_Iage_qt~286 |   .0982921   .0164891     5.96   0.000     .0659733     .130611
_Iage_qt~287 |    .101363   .0169051     6.00   0.000     .0682288    .1344972
_Iage_qt~288 |   .1061312    .016884     6.29   0.000     .0730384     .139224
_Iage_qt~289 |   .1118979    .016675     6.71   0.000     .0792146    .1445812
_Iage_qt~290 |    .109892   .0170013     6.46   0.000     .0765691    .1432148
_Iage_qt~291 |   .1009795   .0169239     5.97   0.000     .0678085    .1341506
_Iage_qt~292 |   .1053908   .0168689     6.25   0.000     .0723276    .1384541
_Iage_qt~293 |    .108107   .0167205     6.47   0.000     .0753345    .1408795
_Iage_qt~294 |   .1014819   .0171606     5.91   0.000     .0678469    .1351169
_Iage_qt~295 |   .1043577   .0170736     6.11   0.000     .0708931    .1378222
_Iage_qt~296 |   .1116632   .0172906     6.46   0.000     .0777734    .1455529
_Iage_qt~297 |   .1128159   .0167611     6.73   0.000     .0799639    .1456678
_Iage_qt~298 |   .1196007   .0173397     6.90   0.000     .0856147    .1535867
_Iage_qt~299 |   .1057599   .0171664     6.16   0.000     .0721134    .1394063
       _cons |   .6909216   .0133784    51.64   0.000     .6646998    .7171434
------------------------------------------------------------------------------

. * Reduced form results.  Impact of Medicare coverage on health outcomes;
. * Outcomes are good_health, delayed_med, not_get_med, hosp_12m;
. * Note that age65 is small and stat insign in all except the hospitalization
>  equation;
. * implying that although Medicare has increased insurance coverage it has no
> t changed outcomes much;
. reg good_health male white black hispanic _Ie* _Iyear* index index2 index_ag
> e65 index2_age65 age65, cluster(index);

Regression with robust standard errors                 Number of obs =   46950
                                                       F( 19,    79) =  206.72
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0810
Number of clusters (index) = 80                        Root MSE      =  .40567

------------------------------------------------------------------------------
             |               Robust
 good_health |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |  -.0012598   .0041154    -0.31   0.760    -.0094512    .0069317
       white |   .0438366   .0111081     3.95   0.000     .0217264    .0659467
       black |  -.0927649   .0128068    -7.24   0.000    -.1182561   -.0672736
    hispanic |    .025925   .0068858     3.77   0.000     .0122192    .0396307
 _Ieduc_r1_2 |   .0803402   .0082268     9.77   0.000     .0639652    .0967152
 _Ieduc_r1_3 |   .2211995   .0075641    29.24   0.000     .2061435    .2362556
 _Ieduc_r1_4 |   .1133665    .013159     8.62   0.000     .0871742    .1395589
 _Ieduc_r1_5 |   .2486983   .0081464    30.53   0.000     .2324832    .2649133
 _Ieduc_r1_6 |    .240662   .0101738    23.66   0.000     .2204116    .2609124
 _Ieduc_r1_7 |   .2925821   .0122599    23.86   0.000     .2681793    .3169848
 _Ieduc_r1_8 |    .315219   .0077415    40.72   0.000       .29981    .3306281
 _Iyear_1999 |   .0051162   .0045294     1.13   0.262    -.0038992    .0141317
 _Iyear_2000 |   .0026664   .0051745     0.52   0.608    -.0076333     .012966
 _Iyear_2001 |  -.0058921   .0050343    -1.17   0.245    -.0159126    .0041283
       index |  -.0000385   .0007733    -0.05   0.960    -.0015777    .0015007
      index2 |    .000021   .0000177     1.19   0.239    -.0000143    .0000564
 index_age65 |   .0002947   .0012073     0.24   0.808    -.0021082    .0026977
index2_age65 |  -.0000676   .0000302    -2.24   0.028    -.0001278   -7.50e-06
       age65 |   .0070009   .0102207     0.68   0.495     -.013343    .0273448
       _cons |   .5326211   .0133632    39.86   0.000     .5060223    .5592199
------------------------------------------------------------------------------

. reg delayed_med male white black hispanic _Ie* _Iyear* index index2 index_ag
> e65 index2_age65 age65, cluster(index);

Regression with robust standard errors                 Number of obs =   46950
                                                       F( 19,    79) =   75.90
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0161
Number of clusters (index) = 80                        Root MSE      =  .24971

------------------------------------------------------------------------------
             |               Robust
 delayed_med |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |  -.0220104   .0022906    -9.61   0.000    -.0265697    -.017451
       white |  -.0061438   .0055896    -1.10   0.275    -.0172696     .004982
       black |  -.0011039   .0066732    -0.17   0.869    -.0143866    .0121788
    hispanic |   .0030924   .0039812     0.78   0.440    -.0048319    .0110167
 _Ieduc_r1_2 |  -.0109521   .0047207    -2.32   0.023    -.0203484   -.0015557
 _Ieduc_r1_3 |  -.0460547   .0046824    -9.84   0.000    -.0553748   -.0367347
 _Ieduc_r1_4 |  -.0139309   .0075724    -1.84   0.070    -.0290034    .0011416
 _Ieduc_r1_5 |  -.0335417   .0049772    -6.74   0.000    -.0434486   -.0236348
 _Ieduc_r1_6 |  -.0425928    .006674    -6.38   0.000     -.055877   -.0293086
 _Ieduc_r1_7 |  -.0453161   .0089788    -5.05   0.000    -.0631879   -.0274443
 _Ieduc_r1_8 |  -.0618797    .005884   -10.52   0.000    -.0735915   -.0501679
 _Iyear_1999 |   .0023618   .0034183     0.69   0.492    -.0044421    .0091658
 _Iyear_2000 |   .0040252   .0032934     1.22   0.225      -.00253    .0105805
 _Iyear_2001 |   .0053107   .0029314     1.81   0.074    -.0005241    .0111455
       index |  -.0015644   .0005322    -2.94   0.004    -.0026236   -.0005052
      index2 |   -.000021   .0000128    -1.64   0.105    -.0000466    4.50e-06
 index_age65 |  -.0002938   .0007122    -0.41   0.681    -.0017114    .0011238
index2_age65 |    .000051   .0000167     3.06   0.003     .0000179    .0000842
       age65 |  -.0047972    .006399    -0.75   0.456     -.017534    .0079396
       _cons |   .1097541   .0075789    14.48   0.000     .0946687    .1248395
------------------------------------------------------------------------------

. reg not_get_med male white black hispanic _Ie* _Iyear* index index2 index_ag
> e65 index2_age65 age65, cluster(index);

Regression with robust standard errors                 Number of obs =   46950
                                                       F( 19,    79) =   53.47
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0187
Number of clusters (index) = 80                        Root MSE      =  .21297

------------------------------------------------------------------------------
             |               Robust
 not_get_med |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |  -.0158153   .0019538    -8.09   0.000    -.0197043   -.0119263
       white |  -.0013835   .0040932    -0.34   0.736    -.0095307    .0067637
       black |   .0200642   .0058561     3.43   0.001     .0084079    .0317205
    hispanic |  -.0032694   .0038145    -0.86   0.394     -.010862    .0043232
 _Ieduc_r1_2 |  -.0088871   .0044165    -2.01   0.048     -.017678   -.0000961
 _Ieduc_r1_3 |  -.0456555   .0046267    -9.87   0.000    -.0548648   -.0364462
 _Ieduc_r1_4 |  -.0191441   .0069387    -2.76   0.007    -.0329553    -.005333
 _Ieduc_r1_5 |  -.0392033   .0045264    -8.66   0.000    -.0482129   -.0301937
 _Ieduc_r1_6 |  -.0414814   .0062056    -6.68   0.000    -.0538333   -.0291296
 _Ieduc_r1_7 |  -.0539067   .0077033    -7.00   0.000    -.0692397   -.0385737
 _Ieduc_r1_8 |  -.0603897   .0052184   -11.57   0.000    -.0707767   -.0500027
 _Iyear_1999 |   .0037696   .0030937     1.22   0.227    -.0023882    .0099274
 _Iyear_2000 |   .0046364   .0026212     1.77   0.081     -.000581    .0098538
 _Iyear_2001 |   .0068705    .002891     2.38   0.020     .0011161    .0126248
       index |  -.0014545   .0004713    -3.09   0.003    -.0023925   -.0005164
      index2 |   -.000022   .0000117    -1.88   0.064    -.0000453    1.33e-06
 index_age65 |  -.0001714   .0005682    -0.30   0.764    -.0013025    .0009596
index2_age65 |   .0000499   .0000142     3.51   0.001     .0000216    .0000782
       age65 |  -.0012621   .0049687    -0.25   0.800     -.011152    .0086278
       _cons |   .0848953   .0067203    12.63   0.000     .0715189    .0982718
------------------------------------------------------------------------------

. reg hosp_12m male white black hispanic _Ie* _Iyear* index index2 index_age65
>  index2_age65 age65, cluster(index);

Regression with robust standard errors                 Number of obs =   46950
                                                       F( 19,    79) =   34.44
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0128
Number of clusters (index) = 80                        Root MSE      =  .33722

------------------------------------------------------------------------------
             |               Robust
    hosp_12m |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0146667   .0034806     4.21   0.000     .0077388    .0215947
       white |   .0129684   .0054696     2.37   0.020     .0020815    .0238553
       black |    .034299    .007078     4.85   0.000     .0202106    .0483874
    hispanic |   .0178585   .0056553     3.16   0.002     .0066018    .0291152
 _Ieduc_r1_2 |  -.0022616   .0057368    -0.39   0.694    -.0136804    .0091573
 _Ieduc_r1_3 |  -.0393039   .0044884    -8.76   0.000    -.0482378     -.03037
 _Ieduc_r1_4 |   .0150464   .0103677     1.45   0.151      -.00559    .0356829
 _Ieduc_r1_5 |  -.0238885   .0061468    -3.89   0.000    -.0361234   -.0116536
 _Ieduc_r1_6 |  -.0326953    .006967    -4.69   0.000    -.0465629   -.0188278
 _Ieduc_r1_7 |  -.0368846   .0106297    -3.47   0.001    -.0580424   -.0157268
 _Ieduc_r1_8 |  -.0561876   .0050667   -11.09   0.000    -.0662728   -.0461025
 _Iyear_1999 |  -.0040603   .0043047    -0.94   0.348    -.0126285    .0045079
 _Iyear_2000 |  -.0008291   .0044667    -0.19   0.853    -.0097198    .0080616
 _Iyear_2001 |  -.0013709   .0046331    -0.30   0.768    -.0105929    .0078511
       index |   .0005039     .00042     1.20   0.234    -.0003321    .0013399
      index2 |  -4.88e-06   .0000116    -0.42   0.675     -.000028    .0000182
 index_age65 |   -.000714   .0010718    -0.67   0.507    -.0028473    .0014193
index2_age65 |   .0000438   .0000274     1.60   0.114    -.0000108    .0000984
       age65 |   .0253064   .0085476     2.96   0.004     .0082929    .0423199
       _cons |   .1134856   .0065795    17.25   0.000     .1003894    .1265818
------------------------------------------------------------------------------

. * examine the sensitivity of the results to the order of the polynomial in t
> he index;
. * linear index;
. reg insured male white black hispanic _Ie* _Iyear* index age65, cluster(inde
> x);

Regression with robust standard errors                 Number of obs =   46950
                                                       F( 16,    79) =  201.53
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0952
Number of clusters (index) = 80                        Root MSE      =  .25995

------------------------------------------------------------------------------
             |               Robust
     insured |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0077421   .0026722     2.90   0.005     .0024232     .013061
       white |   .0399719   .0074097     5.39   0.000     .0252234    .0547205
       black |   .0050161   .0083017     0.60   0.547     -.011508    .0215401
    hispanic |   .1000869   .0074008    13.52   0.000      .085356    .1148177
 _Ieduc_r1_2 |   .0477097   .0079386     6.01   0.000     .0319083     .063511
 _Ieduc_r1_3 |   .0851351   .0100326     8.49   0.000     .0651658    .1051044
 _Ieduc_r1_4 |   .0780044   .0113289     6.89   0.000     .0554548    .1005539
 _Ieduc_r1_5 |   .0970267   .0108474     8.94   0.000     .0754356    .1186178
 _Ieduc_r1_6 |   .1019705   .0112597     9.06   0.000     .0795587    .1243823
 _Ieduc_r1_7 |    .111133   .0139533     7.96   0.000     .0833596    .1389063
 _Ieduc_r1_8 |   .1124915   .0122091     9.21   0.000       .08819    .1367931
 _Iyear_1999 |  -.0001809   .0032472    -0.06   0.956    -.0066443    .0062824
 _Iyear_2000 |  -.0079191   .0033769    -2.35   0.022    -.0146407   -.0011975
 _Iyear_2001 |  -.0002706   .0031185    -0.09   0.931    -.0064778    .0059366
       index |   .0005093   .0001218     4.18   0.000     .0002669    .0007516
       age65 |   .1010953   .0058218    17.36   0.000     .0895073    .1126834
       _cons |   .6811465   .0162693    41.87   0.000     .6487634    .7135297
------------------------------------------------------------------------------

. reg hosp_12m male white black hispanic _Ie* _Iyear* index age65, cluster(ind
> ex);

Regression with robust standard errors                 Number of obs =   46950
                                                       F( 16,    79) =   34.37
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0127
Number of clusters (index) = 80                        Root MSE      =  .33724

------------------------------------------------------------------------------
             |               Robust
    hosp_12m |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0145912   .0034836     4.19   0.000     .0076572    .0215252
       white |    .012793   .0054743     2.34   0.022     .0018967    .0236894
       black |   .0340742   .0070885     4.81   0.000      .019965    .0481835
    hispanic |   .0179911    .005651     3.18   0.002      .006743    .0292392
 _Ieduc_r1_2 |  -.0023875   .0057434    -0.42   0.679    -.0138194    .0090444
 _Ieduc_r1_3 |  -.0393754   .0044789    -8.79   0.000    -.0482903   -.0304604
 _Ieduc_r1_4 |   .0147933   .0104023     1.42   0.159    -.0059119    .0354985
 _Ieduc_r1_5 |  -.0238424   .0061328    -3.89   0.000    -.0360494   -.0116354
 _Ieduc_r1_6 |   -.032514    .006961    -4.67   0.000    -.0463695   -.0186585
 _Ieduc_r1_7 |  -.0368159   .0105957    -3.47   0.001    -.0579062   -.0157256
 _Ieduc_r1_8 |  -.0560898    .005073   -11.06   0.000    -.0661874   -.0459922
 _Iyear_1999 |  -.0040042    .004312    -0.93   0.356     -.012587    .0045786
 _Iyear_2000 |  -.0006789   .0044739    -0.15   0.880    -.0095839    .0082261
 _Iyear_2001 |   -.001327   .0046445    -0.29   0.776    -.0105715    .0079176
       index |   .0009582    .000163     5.88   0.000     .0006337    .0012827
       age65 |   .0153607   .0064529     2.38   0.020     .0025165    .0282048
       _cons |   .1204075   .0071196    16.91   0.000     .1062364    .1345787
------------------------------------------------------------------------------

. * linear index interacted with age65;
. reg insured male white black hispanic _Ie* _Iyear* index index_age65 age65, 
> cluster(index);

Regression with robust standard errors                 Number of obs =   46950
                                                       F( 17,    79) =  209.16
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0952
Number of clusters (index) = 80                        Root MSE      =  .25995

------------------------------------------------------------------------------
             |               Robust
     insured |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0077657   .0026716     2.91   0.005      .002448    .0130834
       white |   .0399986   .0074109     5.40   0.000     .0252476    .0547497
       black |   .0050715   .0082969     0.61   0.543    -.0114431    .0215861
    hispanic |   .1000132   .0074028    13.51   0.000     .0852783    .1147481
 _Ieduc_r1_2 |    .047757   .0079369     6.02   0.000     .0319591     .063555
 _Ieduc_r1_3 |   .0851675   .0100303     8.49   0.000     .0652028    .1051323
 _Ieduc_r1_4 |   .0780789   .0113214     6.90   0.000     .0555442    .1006136
 _Ieduc_r1_5 |   .0970221   .0108486     8.94   0.000     .0754286    .1186157
 _Ieduc_r1_6 |    .101931   .0112591     9.05   0.000     .0795203    .1243418
 _Ieduc_r1_7 |   .1110681   .0139625     7.95   0.000     .0832765    .1388596
 _Ieduc_r1_8 |   .1124531    .012214     9.21   0.000     .0881419    .1367644
 _Iyear_1999 |  -.0002124   .0032461    -0.07   0.948    -.0066736    .0062488
 _Iyear_2000 |  -.0079565   .0033735    -2.36   0.021    -.0146714   -.0012416
 _Iyear_2001 |  -.0002778   .0031184    -0.09   0.929    -.0064848    .0059292
       index |   .0004028   .0001718     2.34   0.022     .0000609    .0007448
 index_age65 |   .0002421   .0002323     1.04   0.301    -.0002203    .0007045
       age65 |   .1008407   .0056701    17.78   0.000     .0895547    .1121268
       _cons |   .6788871   .0161815    41.95   0.000     .6466786    .7110956
------------------------------------------------------------------------------

. reg hosp_12m male white black hispanic _Ie* _Iyear* index index_age65 age65,
>  cluster(index);

Regression with robust standard errors                 Number of obs =   46950
                                                       F( 17,    79) =   35.34
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0128
Number of clusters (index) = 80                        Root MSE      =  .33723

------------------------------------------------------------------------------
             |               Robust
    hosp_12m |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0146471   .0034787     4.21   0.000     .0077229    .0215714
       white |   .0128563   .0054619     2.35   0.021     .0019847    .0237279
       black |   .0342056   .0070776     4.83   0.000      .020118    .0482932
    hispanic |   .0178166   .0056501     3.15   0.002     .0065704    .0290627
 _Ieduc_r1_2 |  -.0022753   .0057361    -0.40   0.693    -.0136928    .0091422
 _Ieduc_r1_3 |  -.0392985   .0044822    -8.77   0.000    -.0482201   -.0303768
 _Ieduc_r1_4 |   .0149698   .0103748     1.44   0.153    -.0056807    .0356204
 _Ieduc_r1_5 |  -.0238533   .0061397    -3.89   0.000     -.036074   -.0116326
 _Ieduc_r1_6 |  -.0326075   .0069686    -4.68   0.000    -.0464781   -.0187369
 _Ieduc_r1_7 |  -.0369697   .0106031    -3.49   0.001    -.0580747   -.0158648
 _Ieduc_r1_8 |  -.0561808   .0050693   -11.08   0.000     -.066271   -.0460906
 _Iyear_1999 |  -.0040788   .0043017    -0.95   0.346    -.0126411    .0044834
 _Iyear_2000 |  -.0007674   .0044716    -0.17   0.864    -.0096679     .008133
 _Iyear_2001 |   -.001344   .0046385    -0.29   0.773    -.0105767    .0078886
       index |   .0007061   .0001477     4.78   0.000     .0004122        .001
 index_age65 |   .0005737     .00031     1.85   0.068    -.0000434    .0011908
       age65 |   .0147574   .0060738     2.43   0.017     .0026677    .0268471
       _cons |   .1150539   .0069817    16.48   0.000     .1011571    .1289506
------------------------------------------------------------------------------

. * second order index;
. reg insured male white black hispanic _Ie* _Iyear* index index2 age65, clust
> er(index);

Regression with robust standard errors                 Number of obs =   46950
                                                       F( 17,    79) =  205.33
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0952
Number of clusters (index) = 80                        Root MSE      =  .25995

------------------------------------------------------------------------------
             |               Robust
     insured |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0077624    .002671     2.91   0.005     .0024459    .0130789
       white |   .0399983   .0074104     5.40   0.000     .0252483    .0547482
       black |   .0050629   .0082962     0.61   0.543    -.0114503    .0215761
    hispanic |   .1000362   .0073993    13.52   0.000     .0853083     .114764
 _Ieduc_r1_2 |    .047754   .0079391     6.02   0.000     .0319516    .0635564
 _Ieduc_r1_3 |   .0851642   .0100319     8.49   0.000     .0651961    .1051322
 _Ieduc_r1_4 |   .0780721   .0113241     6.89   0.000      .055532    .1006123
 _Ieduc_r1_5 |   .0970219   .0108489     8.94   0.000     .0754277    .1186161
 _Ieduc_r1_6 |   .1019341   .0112593     9.05   0.000      .079523    .1243452
 _Ieduc_r1_7 |   .1110783   .0139577     7.96   0.000     .0832962    .1388604
 _Ieduc_r1_8 |   .1124523   .0122124     9.21   0.000     .0881442    .1367605
 _Iyear_1999 |  -.0002038   .0032466    -0.06   0.950    -.0066661    .0062585
 _Iyear_2000 |  -.0079495   .0033747    -2.36   0.021    -.0146666   -.0012324
 _Iyear_2001 |  -.0002712   .0031189    -0.09   0.931    -.0064793    .0059369
       index |   .0005245   .0001178     4.45   0.000       .00029    .0007591
      index2 |   2.39e-06   2.65e-06     0.90   0.369    -2.88e-06    7.67e-06
       age65 |   .1007461    .005693    17.70   0.000     .0894144    .1120778
       _cons |   .6800602   .0161986    41.98   0.000     .6478175    .7123028
------------------------------------------------------------------------------

. reg hosp_12m male white black hispanic _Ie* _Iyear* index index2 age65, clus
> ter(index);

Regression with robust standard errors                 Number of obs =   46950
                                                       F( 17,    79) =   36.37
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0128
Number of clusters (index) = 80                        Root MSE      =  .33723

------------------------------------------------------------------------------
             |               Robust
    hosp_12m |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0146563   .0034795     4.21   0.000     .0077306     .021582
       white |   .0128775   .0054642     2.36   0.021     .0020013    .0237536
       black |   .0342243   .0070784     4.84   0.000     .0201351    .0483134
    hispanic |   .0178287   .0056539     3.15   0.002     .0065749    .0290824
 _Ieduc_r1_2 |  -.0022454   .0057337    -0.39   0.696     -.013658    .0091672
 _Ieduc_r1_3 |  -.0392822   .0044836    -8.76   0.000    -.0482066   -.0303577
 _Ieduc_r1_4 |   .0150105   .0103702     1.45   0.152    -.0056309    .0356519
 _Ieduc_r1_5 |  -.0238577    .006143    -3.88   0.000    -.0360851   -.0116303
 _Ieduc_r1_6 |  -.0326308   .0069652    -4.68   0.000    -.0464945    -.018767
 _Ieduc_r1_7 |  -.0369912   .0106067    -3.49   0.001    -.0581032   -.0158791
 _Ieduc_r1_8 |  -.0562154   .0050687   -11.09   0.000    -.0663044   -.0461265
 _Iyear_1999 |  -.0040774   .0043007    -0.95   0.346    -.0126378    .0044829
 _Iyear_2000 |  -.0007763   .0044691    -0.17   0.863    -.0096718    .0081192
 _Iyear_2001 |  -.0013289   .0046391    -0.29   0.775    -.0105627    .0079049
       index |   .0010072   .0001572     6.41   0.000     .0006943    .0013202
      index2 |   7.68e-06   3.90e-06     1.97   0.053    -8.51e-08    .0000154
       age65 |   .0142413    .006203     2.30   0.024     .0018945    .0265881
       _cons |   .1169255   .0069482    16.83   0.000     .1030955    .1307554
------------------------------------------------------------------------------

. * third order index;
. reg insured male white black hispanic _Ie* _Iyear* index index2 index3 age65
> , cluster(index);

Regression with robust standard errors                 Number of obs =   46950
                                                       F( 18,    79) =  193.87
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0953
Number of clusters (index) = 80                        Root MSE      =  .25994

------------------------------------------------------------------------------
             |               Robust
     insured |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0077558    .002672     2.90   0.005     .0024373    .0130742
       white |   .0399527   .0074053     5.40   0.000     .0252128    .0546926
       black |   .0050158   .0082851     0.61   0.547    -.0114753     .021507
    hispanic |   .1000452   .0074052    13.51   0.000     .0853056    .1147848
 _Ieduc_r1_2 |   .0477817    .007939     6.02   0.000     .0319796    .0635839
 _Ieduc_r1_3 |   .0851892   .0100323     8.49   0.000     .0652205     .105158
 _Ieduc_r1_4 |   .0780706   .0113289     6.89   0.000      .055521    .1006202
 _Ieduc_r1_5 |   .0970441   .0108451     8.95   0.000     .0754574    .1186308
 _Ieduc_r1_6 |   .1019795   .0112568     9.06   0.000     .0795735    .1243856
 _Ieduc_r1_7 |   .1110058   .0139544     7.95   0.000     .0832302    .1387814
 _Ieduc_r1_8 |   .1124172   .0122137     9.20   0.000     .0881065     .136728
 _Iyear_1999 |  -.0002003   .0032415    -0.06   0.951    -.0066522    .0062517
 _Iyear_2000 |  -.0079039   .0033696    -2.35   0.022    -.0146109   -.0011968
 _Iyear_2001 |  -.0002224   .0031212    -0.07   0.943     -.006435    .0059903
       index |   .0009017   .0003096     2.91   0.005     .0002855    .0015179
      index2 |   1.68e-06   2.42e-06     0.69   0.490    -3.14e-06    6.50e-06
      index3 |  -2.65e-07   1.88e-07    -1.41   0.163    -6.39e-07    1.09e-07
       age65 |   .0940567   .0079798    11.79   0.000     .0781733    .1099401
       _cons |   .6837634   .0163994    41.69   0.000     .6511211    .7164056
------------------------------------------------------------------------------

. reg hosp_12m male white black hispanic _Ie* _Iyear* index index2 index3 age6
> 5, cluster(index);

Regression with robust standard errors                 Number of obs =   46950
                                                       F( 18,    79) =   35.57
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0129
Number of clusters (index) = 80                        Root MSE      =  .33722

------------------------------------------------------------------------------
             |               Robust
    hosp_12m |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0146668   .0034801     4.21   0.000     .0077398    .0215939
       white |     .01295   .0054646     2.37   0.020      .002073     .023827
       black |   .0342991   .0070777     4.85   0.000     .0202113     .048387
    hispanic |   .0178143   .0056536     3.15   0.002     .0065612    .0290675
 _Ieduc_r1_2 |  -.0022895   .0057388    -0.40   0.691    -.0137122    .0091333
 _Ieduc_r1_3 |   -.039322   .0044876    -8.76   0.000    -.0482543   -.0303897
 _Ieduc_r1_4 |    .015013   .0103698     1.45   0.152    -.0056276    .0356535
 _Ieduc_r1_5 |   -.023893    .006144    -3.89   0.000    -.0361223   -.0116636
 _Ieduc_r1_6 |  -.0327031   .0069764    -4.69   0.000    -.0465894   -.0188168
 _Ieduc_r1_7 |  -.0368758   .0106335    -3.47   0.001    -.0580412   -.0157104
 _Ieduc_r1_8 |  -.0561596   .0050635   -11.09   0.000    -.0662383    -.046081
 _Iyear_1999 |   -.004083    .004306    -0.95   0.346    -.0126539    .0044878
 _Iyear_2000 |   -.000849   .0044664    -0.19   0.850    -.0097392    .0080413
 _Iyear_2001 |  -.0014066   .0046282    -0.30   0.762    -.0106188    .0078055
       index |   .0004073    .000324     1.26   0.212    -.0002377    .0010523
      index2 |   8.82e-06   3.67e-06     2.40   0.019     1.51e-06    .0000161
      index3 |   4.21e-07   2.20e-07     1.91   0.059    -1.70e-08    8.59e-07
       age65 |   .0248823    .007582     3.28   0.002     .0097906    .0399739
       _cons |   .1110346   .0072615    15.29   0.000     .0965811    .1254882
------------------------------------------------------------------------------

. * third order index interacted with age;
. reg insured male white black hispanic _Ie* _Iyear* index index2 index3 
> index_age65 index2_age65 index3_age65 age65, cluster(index);

Regression with robust standard errors                 Number of obs =   46950
                                                       F( 21,    79) =  182.44
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0954
Number of clusters (index) = 80                        Root MSE      =  .25993

------------------------------------------------------------------------------
             |               Robust
     insured |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0077901   .0026721     2.92   0.005     .0024714    .0131087
       white |   .0398671   .0074129     5.38   0.000     .0251121    .0546221
       black |   .0049641   .0082981     0.60   0.551    -.0115528    .0214811
    hispanic |   .1000465   .0074083    13.50   0.000     .0853006    .1147924
 _Ieduc_r1_2 |   .0477112   .0079492     6.00   0.000     .0318887    .0635336
 _Ieduc_r1_3 |   .0851434   .0100355     8.48   0.000     .0651683    .1051185
 _Ieduc_r1_4 |     .07805   .0113095     6.90   0.000     .0555389     .100561
 _Ieduc_r1_5 |   .0970158   .0108468     8.94   0.000     .0754258    .1186058
 _Ieduc_r1_6 |   .1019928   .0112501     9.07   0.000        .0796    .1243856
 _Ieduc_r1_7 |     .11087   .0139647     7.94   0.000     .0830739    .1386661
 _Ieduc_r1_8 |   .1124232    .012211     9.21   0.000     .0881178    .1367285
 _Iyear_1999 |   -.000215   .0032455    -0.07   0.947     -.006675     .006245
 _Iyear_2000 |  -.0078676   .0033607    -2.34   0.022    -.0145569   -.0011783
 _Iyear_2001 |  -.0002148   .0031143    -0.07   0.945    -.0064138    .0059841
       index |   .0006851   .0017412     0.39   0.695    -.0027808    .0041509
      index2 |   1.60e-06   .0001067     0.02   0.988    -.0002107    .0002139
      index3 |  -1.42e-07   1.79e-06    -0.08   0.937    -3.71e-06    3.43e-06
 index_age65 |   .0036536   .0023731     1.54   0.128    -.0010698    .0083771
index2_age65 |  -.0002017   .0001372    -1.47   0.145    -.0004748    .0000714
index3_age65 |   3.10e-06   2.24e-06     1.38   0.171    -1.36e-06    7.57e-06
       age65 |   .0840021   .0105949     7.93   0.000     .0629134    .1050907
       _cons |   .6814804   .0167107    40.78   0.000     .6482186    .7147422
------------------------------------------------------------------------------

. reg hosp_12m male white black hispanic _Ie* _Iyear* index index2 index3 
> index_age65 index2_age65 index3_age65 age65, cluster(index);

Regression with robust standard errors                 Number of obs =   46950
                                                       F( 21,    79) =   45.99
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0133
Number of clusters (index) = 80                        Root MSE      =  .33716

------------------------------------------------------------------------------
             |               Robust
    hosp_12m |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0147891   .0034821     4.25   0.000     .0078581      .02172
       white |   .0128651   .0054375     2.37   0.020      .002042    .0236883
       black |   .0342243   .0070827     4.83   0.000     .0201266     .048322
    hispanic |   .0180287   .0056545     3.19   0.002     .0067737    .0292838
 _Ieduc_r1_2 |  -.0024124   .0057204    -0.42   0.674    -.0137986    .0089739
 _Ieduc_r1_3 |  -.0394072   .0044817    -8.79   0.000    -.0483278   -.0304866
 _Ieduc_r1_4 |   .0151503   .0103685     1.46   0.148    -.0054877    .0357883
 _Ieduc_r1_5 |  -.0239917   .0061445    -3.90   0.000     -.036222   -.0117614
 _Ieduc_r1_6 |  -.0326706   .0069293    -4.71   0.000    -.0464631   -.0188781
 _Ieduc_r1_7 |  -.0372355   .0106453    -3.50   0.001    -.0584245   -.0160465
 _Ieduc_r1_8 |  -.0562148   .0050681   -11.09   0.000    -.0663026    -.046127
 _Iyear_1999 |  -.0040034   .0043061    -0.93   0.355    -.0125744    .0045677
 _Iyear_2000 |  -.0006883   .0044584    -0.15   0.878    -.0095626    .0081859
 _Iyear_2001 |  -.0012678   .0046354    -0.27   0.785    -.0104943    .0079587
       index |  -.0012431   .0012205    -1.02   0.312    -.0036725    .0011864
      index2 |  -.0001092   .0000728    -1.50   0.137    -.0002541    .0000357
      index3 |  -1.69e-06   1.19e-06    -1.42   0.160    -4.06e-06    6.82e-07
 index_age65 |   .0084893    .002254     3.77   0.000     .0040028    .0129758
index2_age65 |  -.0003443   .0001375    -2.50   0.014     -.000618   -.0000706
index3_age65 |   .0000102   2.30e-06     4.43   0.000     5.61e-06    .0000148
       age65 |   .0098602   .0093941     1.05   0.297    -.0088383    .0285587
       _cons |   .1070064   .0073784    14.50   0.000     .0923201    .1216927
------------------------------------------------------------------------------

. * fourth order index;
. reg insured male white black hispanic _Ie* _Iyear* index index2 index3 index
> 4 age65, cluster(index);

Regression with robust standard errors                 Number of obs =   46950
                                                       F( 19,    79) =  184.93
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0953
Number of clusters (index) = 80                        Root MSE      =  .25995

------------------------------------------------------------------------------
             |               Robust
     insured |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0077514   .0026706     2.90   0.005     .0024358    .0130671
       white |   .0399479   .0074071     5.39   0.000     .0252044    .0546914
       black |   .0050158   .0082868     0.61   0.547    -.0114786    .0215102
    hispanic |   .1000284   .0074076    13.50   0.000     .0852839    .1147729
 _Ieduc_r1_2 |   .0477808   .0079383     6.02   0.000     .0319799    .0635816
 _Ieduc_r1_3 |   .0851892   .0100319     8.49   0.000     .0652212    .1051572
 _Ieduc_r1_4 |    .078058   .0113236     6.89   0.000     .0555189     .100597
 _Ieduc_r1_5 |   .0970478   .0108451     8.95   0.000     .0754613    .1186343
 _Ieduc_r1_6 |   .1019803   .0112562     9.06   0.000     .0795753    .1243852
 _Ieduc_r1_7 |   .1110132   .0139535     7.96   0.000     .0832394     .138787
 _Ieduc_r1_8 |   .1124232   .0122144     9.20   0.000     .0881111    .1367353
 _Iyear_1999 |  -.0002079   .0032414    -0.06   0.949    -.0066597    .0062439
 _Iyear_2000 |  -.0079098   .0033666    -2.35   0.021    -.0146109   -.0012088
 _Iyear_2001 |  -.0002315   .0031176    -0.07   0.941    -.0064369    .0059739
       index |   .0009118   .0003006     3.03   0.003     .0003134    .0015102
      index2 |   4.20e-06   9.93e-06     0.42   0.674    -.0000156     .000024
      index3 |  -2.74e-07   1.77e-07    -1.54   0.126    -6.27e-07    7.91e-08
      index4 |  -1.86e-09   6.89e-09    -0.27   0.788    -1.56e-08    1.18e-08
       age65 |   .0939466   .0079056    11.88   0.000     .0782108    .1096823
       _cons |   .6834435   .0164608    41.52   0.000     .6506791    .7162079
------------------------------------------------------------------------------

. reg hosp_12m male white black hispanic _Ie* _Iyear* index index2 index3 inde
> x4 age65, cluster(index);

Regression with robust standard errors                 Number of obs =   46950
                                                       F( 19,    79) =   44.51
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0130
Number of clusters (index) = 80                        Root MSE      =   .3372

------------------------------------------------------------------------------
             |               Robust
    hosp_12m |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0147142   .0034831     4.22   0.000     .0077812    .0216472
       white |   .0130023   .0054653     2.38   0.020      .002124    .0238806
       black |   .0342998   .0070792     4.85   0.000      .020209    .0483907
    hispanic |   .0179987   .0056575     3.18   0.002     .0067378    .0292595
 _Ieduc_r1_2 |  -.0022791   .0057341    -0.40   0.692    -.0136925    .0091343
 _Ieduc_r1_3 |  -.0393221   .0044928    -8.75   0.000    -.0482648   -.0303794
 _Ieduc_r1_4 |   .0151513   .0103606     1.46   0.148    -.0054708    .0357735
 _Ieduc_r1_5 |  -.0239338   .0061529    -3.89   0.000    -.0361807   -.0116868
 _Ieduc_r1_6 |  -.0327112   .0069429    -4.71   0.000    -.0465306   -.0188917
 _Ieduc_r1_7 |  -.0369571   .0106395    -3.47   0.001    -.0581344   -.0157797
 _Ieduc_r1_8 |  -.0562251   .0050667   -11.10   0.000    -.0663101   -.0461401
 _Iyear_1999 |  -.0039995   .0043036    -0.93   0.356    -.0125657    .0045666
 _Iyear_2000 |  -.0007834   .0044679    -0.18   0.861    -.0096764    .0081097
 _Iyear_2001 |  -.0013064    .004633    -0.28   0.779    -.0105282    .0079153
       index |   .0002964   .0003567     0.83   0.409    -.0004136    .0010064
      index2 |  -.0000188   .0000119    -1.58   0.118    -.0000425    4.90e-06
      index3 |   5.23e-07   2.30e-07     2.27   0.026     6.42e-08    9.82e-07
      index4 |   2.04e-08   8.42e-09     2.42   0.018     3.62e-09    3.72e-08
       age65 |   .0260884    .008432     3.09   0.003      .009305    .0428717
       _cons |   .1145381   .0069235    16.54   0.000     .1007573    .1283189
------------------------------------------------------------------------------

. * fourth order index interacted with age;
. reg insured male white black hispanic _Ie* _Iyear* index index2 index3 index
> 4
> index_age65 index2_age65 index3_age65 index4_age65 age65, cluster(index);

Regression with robust standard errors                 Number of obs =   46950
                                                       F( 23,    79) =  168.88
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0954
Number of clusters (index) = 80                        Root MSE      =  .25993

------------------------------------------------------------------------------
             |               Robust
     insured |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0077804   .0026683     2.92   0.005     .0024692    .0130916
       white |   .0399365   .0074138     5.39   0.000     .0251797    .0546934
       black |    .004969   .0083069     0.60   0.551    -.0115654    .0215035
    hispanic |   .1000416   .0074074    13.51   0.000     .0852976    .1147856
 _Ieduc_r1_2 |   .0476683   .0079581     5.99   0.000     .0318281    .0635085
 _Ieduc_r1_3 |   .0851218   .0100382     8.48   0.000     .0651412    .1051025
 _Ieduc_r1_4 |   .0780272   .0113086     6.90   0.000      .055518    .1005365
 _Ieduc_r1_5 |   .0970224   .0108439     8.95   0.000     .0754382    .1186065
 _Ieduc_r1_6 |   .1019957   .0112545     9.06   0.000     .0795942    .1243972
 _Ieduc_r1_7 |   .1107789   .0139784     7.92   0.000     .0829555    .1386023
 _Ieduc_r1_8 |   .1124053    .012215     9.20   0.000     .0880919    .1367188
 _Iyear_1999 |  -.0001822   .0032445    -0.06   0.955    -.0066403    .0062759
 _Iyear_2000 |  -.0078288   .0033611    -2.33   0.022     -.014519   -.0011387
 _Iyear_2001 |  -.0002154    .003117    -0.07   0.945    -.0064198    .0059889
       index |   .0034912   .0034478     1.01   0.314    -.0033715    .0103539
      index2 |   .0002994   .0003537     0.85   0.400    -.0004046    .0010035
      index3 |    .000011   .0000134     0.82   0.413    -.0000157    .0000377
      index4 |   1.36e-07   1.68e-07     0.81   0.422    -1.99e-07    4.71e-07
 index_age65 |   .0036795   .0044224     0.83   0.408    -.0051231     .012482
index2_age65 |  -.0008415   .0004352    -1.93   0.057    -.0017078    .0000248
index3_age65 |   5.84e-06   .0000161     0.36   0.717    -.0000262    .0000378
index4_age65 |  -3.16e-07   1.99e-07    -1.59   0.116    -7.11e-07    7.99e-08
       age65 |   .0729157   .0129554     5.63   0.000     .0471287    .0987027
       _cons |   .6878042   .0183904    37.40   0.000      .651199    .7244094
------------------------------------------------------------------------------

. reg hosp_12m male white black hispanic _Ie* _Iyear* index index2 index3 inde
> x4
> index_age65 index2_age65 index3_age65 index4_age65 age65, cluster(index);

Regression with robust standard errors                 Number of obs =   46950
                                                       F( 23,    79) =   42.45
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0133
Number of clusters (index) = 80                        Root MSE      =  .33716

------------------------------------------------------------------------------
             |               Robust
    hosp_12m |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0148118   .0034845     4.25   0.000     .0078761    .0217475
       white |   .0127631   .0054317     2.35   0.021     .0019516    .0235747
       black |   .0341694    .007087     4.82   0.000      .020063    .0482757
    hispanic |   .0180424   .0056617     3.19   0.002     .0067731    .0293116
 _Ieduc_r1_2 |  -.0023811   .0057212    -0.42   0.678    -.0137688    .0090066
 _Ieduc_r1_3 |  -.0393895   .0044786    -8.80   0.000    -.0483039   -.0304751
 _Ieduc_r1_4 |   .0151862    .010367     1.46   0.147    -.0054488    .0358213
 _Ieduc_r1_5 |  -.0240106   .0061428    -3.91   0.000    -.0362377   -.0117836
 _Ieduc_r1_6 |  -.0326787   .0069337    -4.71   0.000    -.0464799   -.0188774
 _Ieduc_r1_7 |  -.0371437   .0106444    -3.49   0.001    -.0583308   -.0159566
 _Ieduc_r1_8 |  -.0561931    .005073   -11.08   0.000    -.0662905   -.0460956
 _Iyear_1999 |  -.0040403   .0043064    -0.94   0.351    -.0126121    .0045314
 _Iyear_2000 |   -.000737   .0044632    -0.17   0.869    -.0096207    .0081467
 _Iyear_2001 |  -.0012725   .0046376    -0.27   0.785    -.0105034    .0079584
       index |  -.0026089   .0031033    -0.84   0.403    -.0087859    .0035682
      index2 |  -.0002542   .0003106    -0.82   0.416    -.0008725    .0003641
      index3 |  -7.13e-06   .0000114    -0.63   0.533    -.0000298    .0000155
      index4 |  -6.62e-08   1.38e-07    -0.48   0.632    -3.40e-07    2.08e-07
 index_age65 |   .0055883    .004673     1.20   0.235    -.0037131    .0148896
index2_age65 |   .0003159   .0005007     0.63   0.530    -.0006807    .0013125
index3_age65 |  -5.31e-06   .0000193    -0.28   0.783    -.0000436     .000033
index4_age65 |   3.37e-07   2.39e-07     1.41   0.162    -1.38e-07    8.12e-07
       age65 |   .0200629   .0109178     1.84   0.070    -.0016684    .0417943
       _cons |   .1039829   .0102009    10.19   0.000     .0836785    .1242873
------------------------------------------------------------------------------

. log close;
       log:  c:\www\econ626\stata\card_et_al.log
  log type:  text
 closed on:  26 Sep 2006, 13:52:48
------------------------------------------------------------------------------
