-------------------------------------------------------------------------------
       log:  c:\bill\spring2011\jtoa_training.log
  log type:  text
 opened on:  11 Apr 2011, 14:43:41

.   * open log file;
. * get some measure of partial compliance;
. tab treatment assignment, row column;

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

     =1 if |
 repondend |
 went into |
       job | =1 if assigned to job
 training, |     training, =0
        =0 |       otherwise
 otherwise |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,684      1,282 |     2,966 
           |     56.78      43.22 |    100.00 
           |     98.88      37.72 |     58.13 
-----------+----------------------+----------
         1 |        19      2,117 |     2,136 
           |      0.89      99.11 |    100.00 
           |      1.12      62.28 |     41.87 
-----------+----------------------+----------
     Total |     1,703      3,399 |     5,102 
           |     33.38      66.62 |    100.00 
           |    100.00     100.00 |    100.00 


. * define the exogenous covariates in the regressions;
. local xlist hsorged black hispanic age* 
> wkless13 married;

. * get OLS estimates of the impact of job training;
. reg earnings `xlist' treatment;

      Source |       SS       df       MS              Number of obs =    5102
-------------+------------------------------           F( 11,  5090) =   44.07
       Model |  1.6937e+11    11  1.5398e+10           Prob > F      =  0.0000
    Residual |  1.7783e+12  5090   349363638           R-squared     =  0.0870
-------------+------------------------------           Adj R-squared =  0.0850
       Total |  1.9476e+12  5101   381814524           Root MSE      =   18691

------------------------------------------------------------------------------
    earnings |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     hsorged |   3827.904   592.5323     6.46   0.000     2666.286    4989.523
       black |  -2609.299     629.53    -4.14   0.000    -3843.449    -1375.15
    hispanic |   145.7383   907.6409     0.16   0.872    -1633.628    1925.105
     age2225 |   5834.095   1546.975     3.77   0.000     2801.359     8866.83
     age2629 |   7052.115    1565.75     4.50   0.000     3982.572    10121.66
     age3035 |   5608.143   1542.558     3.64   0.000     2584.066     8632.22
     age3664 |   4541.626   1555.574     2.92   0.004     1492.031    7591.221
     age4554 |   2143.938   1705.458     1.26   0.209    -1199.494     5487.37
    wkless13 |    -6571.3   573.6429   -11.46   0.000    -7695.886   -5446.713
     married |   6539.927   583.9488    11.20   0.000     5395.136    7684.718
   treatment |   3574.821   531.9044     6.72   0.000     2532.059    4617.582
       _cons |   10702.56    1579.97     6.77   0.000     7605.138    13799.98
------------------------------------------------------------------------------

. * use assignment as instrument for treatment;
. * estimates 2sls model -- ignores DGP for treatment;
. reg earnings `xlist' treatment (`xlist' assignment);

Instrumental variables (2SLS) regression

      Source |       SS       df       MS              Number of obs =    5102
-------------+------------------------------           F( 11,  5090) =   40.14
       Model |  1.6458e+11    11  1.4962e+10           Prob > F      =  0.0000
    Residual |  1.7831e+12  5090   350305477           R-squared     =  0.0845
-------------+------------------------------           Adj R-squared =  0.0825
       Total |  1.9476e+12  5101   381814524           Root MSE      =   18716

------------------------------------------------------------------------------
    earnings |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   treatment |   1604.478   910.2379     1.76   0.078    -179.9802    3388.935
       black |  -2567.936   630.5684    -4.07   0.000    -3804.121   -1331.751
    hispanic |   237.2353   909.5097     0.26   0.794    -1545.795    2020.266
     age2225 |    5813.21   1549.078     3.75   0.000      2776.35    8850.069
     age2629 |   6954.926   1568.282     4.43   0.000     3880.419    10029.43
     age3035 |   5543.021   1544.829     3.59   0.000     2514.493     8571.55
     age3664 |   4429.381   1558.237     2.84   0.004     1374.566    7484.196
     age4554 |   1997.164   1708.641     1.17   0.243    -1352.506    5346.835
    wkless13 |  -6566.331   574.4186   -11.43   0.000    -7692.438   -5440.223
     married |   6636.138   585.8452    11.33   0.000     5487.629    7784.647
     hsorged |   3909.796   594.1231     6.58   0.000     2745.059    5074.533
       _cons |   11489.81   1609.352     7.14   0.000      8334.79    14644.83
------------------------------------------------------------------------------

. * show first stage probit for treatment effect;
. probit treatment `xlist' assignment;

Iteration 0:   log likelihood = -3468.6232
Iteration 1:   log likelihood = -2451.7414
Iteration 2:   log likelihood = -2354.1117
Iteration 3:   log likelihood =  -2341.312
Iteration 4:   log likelihood =  -2340.618
Iteration 5:   log likelihood = -2340.6141

Probit regression                                 Number of obs   =       5102
                                                  LR chi2(11)     =    2256.02
                                                  Prob > chi2     =     0.0000
Log likelihood = -2340.6141                       Pseudo R2       =     0.3252

------------------------------------------------------------------------------
   treatment |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     hsorged |    .155783   .0480717     3.24   0.001     .0615642    .2500018
       black |   .0727836   .0512158     1.42   0.155    -.0275974    .1731647
    hispanic |   .1388195   .0739482     1.88   0.060    -.0061163    .2837553
     age2225 |  -.0453221   .1249173    -0.36   0.717    -.2901555    .1995114
     age2629 |  -.2219305   .1260843    -1.76   0.078    -.4690513    .0251903
     age3035 |  -.1158453   .1243525    -0.93   0.352    -.3595718    .1278811
     age3664 |   -.216024   .1257496    -1.72   0.086    -.4624888    .0304407
     age4554 |  -.2236721   .1384802    -1.62   0.106    -.4950884    .0477442
    wkless13 |  -.0189245   .0466568    -0.41   0.685    -.1103702    .0725211
     married |   .1196308   .0474253     2.52   0.012     .0266789    .2125828
  assignment |   2.611109   .0899701    29.02   0.000     2.434771    2.787447
       _cons |  -2.327078   .1509532   -15.42   0.000    -2.622941   -2.031215
------------------------------------------------------------------------------

. * the mismeasured treatment effect model;
. * the syntax is treatreg y x, treat(t=x z) where y is the outcome;
. * x is the list of exogenous factrors, t is the treatment variable;
. * and z are the instruments;
. treatreg earnings `xlist', treat(treatment=`xlist' assignment);

Iteration 0:   log likelihood = -59753.761  
Iteration 1:   log likelihood = -59753.747  
Iteration 2:   log likelihood = -59753.747  

Treatment-effects model -- MLE                    Number of obs   =       5102
                                                  Wald chi2(11)   =     444.86
Log likelihood = -59753.747                       Prob > chi2     =     0.0000

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
earnings     |
     hsorged |   3894.686   593.0899     6.57   0.000     2732.251    5057.121
       black |  -2575.568   629.5268    -4.09   0.000    -3809.418   -1341.718
    hispanic |   220.3526   907.9759     0.24   0.808    -1559.248    1999.953
     age2225 |   5817.063   1546.557     3.76   0.000     2785.867     8848.26
     age2629 |   6972.859   1565.696     4.45   0.000     3904.152    10041.57
     age3035 |   5555.038     1542.3     3.60   0.000     2532.185     8577.89
     age3664 |   4450.092   1555.655     2.86   0.004     1401.064     7499.12
     age4554 |   2024.247   1705.787     1.19   0.235    -1319.035    5367.528
    wkless13 |  -6567.248   573.4842   -11.45   0.000    -7691.256   -5443.239
     married |   6618.385   584.7987    11.32   0.000     5472.201     7764.57
   treatment |    1968.04   883.0844     2.23   0.026     237.2265    3698.854
       _cons |   11344.55   1604.448     7.07   0.000      8199.89    14489.21
-------------+----------------------------------------------------------------
treatment    |
     hsorged |   .1574098   .0480538     3.28   0.001      .063226    .2515936
       black |   .0718658   .0511572     1.40   0.160    -.0284005    .1721321
    hispanic |   .1380297   .0739335     1.87   0.062    -.0068773    .2829367
     age2225 |  -.0500384   .1247828    -0.40   0.688    -.2946083    .1945315
     age2629 |  -.2251408   .1259115    -1.79   0.074    -.4719227    .0216411
     age3035 |  -.1189649   .1242019    -0.96   0.338    -.3623962    .1244664
     age3664 |  -.2201547   .1255955    -1.75   0.080    -.4663174     .026008
     age4554 |  -.2216769   .1383267    -1.60   0.109    -.4927922    .0494384
    wkless13 |  -.0183814   .0466375    -0.39   0.693    -.1097892    .0730264
     married |   .1175322   .0474124     2.48   0.013     .0246056    .2104587
  assignment |   2.607888   .0896832    29.08   0.000     2.432112    2.783664
       _cons |  -2.320411   .1506683   -15.40   0.000    -2.615716   -2.025107
-------------+----------------------------------------------------------------
     /athrho |   .0799418   .0351193     2.28   0.023     .0111093    .1487743
    /lnsigma |    9.83553   .0099483   988.67   0.000     9.816032    9.855029
-------------+----------------------------------------------------------------
         rho |    .079772   .0348958                      .0111089    .1476863
       sigma |   18686.01   185.8936                       18325.2    19053.93
      lambda |    1490.62   653.7324                      209.3276    2771.912
------------------------------------------------------------------------------
LR test of indep. eqns. (rho = 0):   chi2(1) =     5.19   Prob > chi2 = 0.0227
------------------------------------------------------------------------------

. * now estimate a model that is identified solely based on the;
. * non-linearities in the model;
. treatreg earnings `xlist', treat(treatment=`xlist');

Iteration 0:   log likelihood = -63324.767  (not concave)
Iteration 1:   log likelihood = -61583.156  
Iteration 2:   log likelihood = -61318.037  
Iteration 3:   log likelihood = -61126.462  
Iteration 4:   log likelihood = -60871.661  (not concave)
Iteration 5:   log likelihood = -60868.491  (not concave)
Iteration 6:   log likelihood = -60868.297  (not concave)
Iteration 7:   log likelihood =  -60867.95  (not concave)
Iteration 8:   log likelihood = -60867.665  (not concave)
Iteration 9:   log likelihood = -60867.518  (not concave)
Iteration 10:  log likelihood = -60867.379  (not concave)
Iteration 11:  log likelihood =  -60867.24  (not concave)
Iteration 12:  log likelihood = -60867.085  (not concave)
Iteration 13:  log likelihood = -60866.825  (not concave)
Iteration 14:  log likelihood = -60866.448  (not concave)
Iteration 15:  log likelihood = -60865.974  (not concave)
Iteration 16:  log likelihood = -60865.763  (not concave)
Iteration 17:  log likelihood = -60865.541  (not concave)
Iteration 18:  log likelihood = -60865.304  (not concave)
Iteration 19:  log likelihood = -60865.055  (not concave)
Iteration 20:  log likelihood = -60864.796  (not concave)
Iteration 21:  log likelihood = -60864.525  (not concave)
Iteration 22:  log likelihood = -60864.242  (not concave)
Iteration 23:  log likelihood = -60863.946  (not concave)
Iteration 24:  log likelihood = -60863.639  (not concave)
Iteration 25:  log likelihood = -60863.319  (not concave)
Iteration 26:  log likelihood = -60862.988  (not concave)
Iteration 27:  log likelihood = -60862.645  (not concave)
Iteration 28:  log likelihood = -60862.291  (not concave)
Iteration 29:  log likelihood = -60861.927  (not concave)
Iteration 30:  log likelihood = -60861.553  (not concave)
Iteration 31:  log likelihood =  -60861.17  (not concave)
Iteration 32:  log likelihood = -60860.779  (not concave)
Iteration 33:  log likelihood = -60860.381  (not concave)
Iteration 34:  log likelihood = -60859.978  (not concave)
Iteration 35:  log likelihood = -60859.571  (not concave)
Iteration 36:  log likelihood = -60859.161  (not concave)
Iteration 37:  log likelihood = -60858.749  (not concave)
Iteration 38:  log likelihood = -60858.338  
Iteration 39:  log likelihood = -60850.815  
Iteration 40:  log likelihood = -60849.761  
Iteration 41:  log likelihood = -60849.761  

Treatment-effects model -- MLE                    Number of obs   =       5102
                                                  Wald chi2(11)   =     657.74
Log likelihood = -60849.761                       Prob > chi2     =     0.0000

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
earnings     |
     hsorged |   2784.881   711.8934     3.91   0.000     1389.595    4180.166
       black |  -3136.126   754.4108    -4.16   0.000    -4614.744   -1657.508
    hispanic |  -1019.619   1088.794    -0.94   0.349    -3153.615    1114.378
     age2225 |    6100.07   1852.519     3.29   0.001     2469.199    9730.941
     age2629 |   8289.941   1876.199     4.42   0.000     4612.658    11967.22
     age3035 |    6437.54   1847.744     3.48   0.000     2816.028    10059.05
     age3664 |   5971.208   1864.444     3.20   0.001     2316.966    9625.451
     age4554 |   4013.294   2044.868     1.96   0.050     5.425945    8021.162
    wkless13 |  -6634.589    686.931    -9.66   0.000    -7980.949   -5288.229
     married |   5314.524   702.5547     7.56   0.000     3937.542    6691.506
   treatment |    28670.2   1529.987    18.74   0.000     25671.48    31668.92
       _cons |   675.6925   1971.925     0.34   0.732    -3189.209    4540.594
-------------+----------------------------------------------------------------
treatment    |
     hsorged |   .0951809   .0395507     2.41   0.016      .017663    .1726988
       black |   .0480052   .0421552     1.14   0.255    -.0346175    .1306279
    hispanic |   .1133994   .0601488     1.89   0.059    -.0044901    .2312889
     age2225 |  -.0307723   .1035774    -0.30   0.766    -.2337802    .1722356
     age2629 |   -.146704   .1050382    -1.40   0.163     -.352575    .0591671
     age3035 |  -.0851166   .1033332    -0.82   0.410    -.2876459    .1174127
     age3664 |  -.1520699   .1042509    -1.46   0.145    -.3563979     .052258
     age4554 |  -.1850599   .1143236    -1.62   0.106    -.4091301    .0390103
    wkless13 |   .0201202   .0382599     0.53   0.599    -.0548679    .0951082
     married |   .1168591   .0389197     3.00   0.003     .0405778    .1931404
       _cons |  -.2365043   .1048147    -2.26   0.024    -.4419373   -.0310713
-------------+----------------------------------------------------------------
     /athrho |   -.870412    .054429   -15.99   0.000    -.9770909   -.7637331
    /lnsigma |   10.01603   .0210262   476.36   0.000     9.974815    10.05724
-------------+----------------------------------------------------------------
         rho |  -.7015834    .027638                     -.7518038   -.6432706
       sigma |    22382.3   470.6146                      21478.66    23323.96
      lambda |  -15703.05   922.6357                     -17511.38   -13894.72
------------------------------------------------------------------------------
LR test of indep. eqns. (rho = 0):   chi2(1) =    40.73   Prob > chi2 = 0.0000
------------------------------------------------------------------------------

. log close;
       log:  c:\bill\spring2011\jtoa_training.log
  log type:  text
 closed on:  11 Apr 2011, 14:43:58
-------------------------------------------------------------------------------
