------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /accounts/fac/card/gradlab/250a/ps3/mroz2.log
  log type:  text
 opened on:  25 Sep 2013, 22:33:08

. use mroz;

. summ;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
       state |      4066    52.93778    26.29072         11         95
       hhnum |      4066    46720.86    27864.72          5      95984
   cbsa_size |      4066    3.575996    2.540933          0          7
      famnum |      4066           1           0          1          1
        himm |      4066    .1633055    .3696896          0          1
-------------+--------------------------------------------------------
       hgen2 |      4066    .0536153    .2252848          0          1
       heduc |      4066    14.02779    2.865233          0         20
      htwage |      3789    29.49427    29.48436          4        400
     hannhrs |      4066    2023.881     779.647          0       5148
    hfamearn |      4066    94954.48    84785.71          0    1379999
-------------+--------------------------------------------------------
       h_age |      4066    46.05411    10.33781         24         64
       hrace |      4066    1.339154    1.068768          1         18
    hwagesal |      4066    60047.99     71998.9          0    1099999
   hwage_ogr |      3281    27.31807    25.59534        .02       1154
    hselfinc |      4066    2213.234    20961.01      -9999    1000000
-------------+--------------------------------------------------------
    hfarminc |      4066    431.3874    7155.457      -9999     300000
    hclassly |      4066    1.646335    1.492534          0          6
     hhealth |      4066    2.107723    .9515725          1          5
    hweeksly |      4066    46.36645    14.47371          0         52
    hhrswkly |      4066    40.46335    14.24178          0         99
-------------+--------------------------------------------------------
    hogrflag |      4066    .8285785    .3769233          0          1
     hrgroup |      4066     1.52607    1.025353          1          5
   ownkidsu6 |      4066    .2909493    .6152644          0          5
  ownkidsu18 |      4066    .9584358    1.160012          0          9
        wimm |      4066    .1650271    .3712506          0          1
-------------+--------------------------------------------------------
       wgen2 |      4066    .0577964    .2333867          0          1
       weduc |      4066    14.17609    2.701005          0         20
      wtwage |      3265    21.70395    21.57611          4        400
     wannhrs |      4066    1464.556    926.4915          0       4653
    wfamearn |      4066    94954.48    84785.71          0    1379999
-------------+--------------------------------------------------------
       w_age |      4066    44.24127    10.34809         24         64
       wrace |      4066    1.361535     1.10912          1         18
    wwagesal |      4066    31840.38    41224.53          0    1099999
   wwage_ogr |      2906    21.29521    14.07471        .04        260
    wselfinc |      4066    1090.773    11644.49      -9999     450000
-------------+--------------------------------------------------------
    wfarminc |      4066    28.13822    1368.477      -4000      84400
    wclassly |      4066    1.453517    1.480311          0          7
    wweeksly |      4066    38.71864    21.09423          0         52
    whrswkly |      4066    29.90113    17.61405          0         99
     whealth |      4066    2.107723    .9487245          1          5
-------------+--------------------------------------------------------
    wogrflag |      4066    .7316773     .443141          0          1
     wrgroup |      4066    1.549434    1.051276          1          5
   mergestat |         0
    wifework |      4066    .8030005    .3977809          0          1
 husbandwork |      4066    .9318741    .2519929          0          1
-------------+--------------------------------------------------------
     age_gap |      4066    1.812838    4.754866        -31         27
  wagesalgap |      4066    28207.61    81644.56    -911488    1099999
     educgap |      4066    -.148303    2.435064        -16         12
    hlogwage |      3789    3.118612    .7264443   1.386294   5.991465
    wlogwage |      3265    2.833157    .6825152   1.386294   5.991465
-------------+--------------------------------------------------------
        hexp |      4066    26.02632    10.73865          0         55
       hexp2 |      4066    7.926594    5.549561          0      30.25
       hexp3 |      4066    26.44724    24.85961          0    166.375
      hblack |      4066    .0568126    .2315126          0          1
      wblack |      4066    .0518938    .2218398          0          1
-------------+--------------------------------------------------------
   hhispanic |      4066     .110182     .313155          0          1
   whispanic |      4066    .1121495    .3155891          0          1
wife_wage_~r |      4066    .7147073    .4516093          0          1
husband_wa~r |      4066    .8069356    .3947517          0          1
missing_ww~r |      4066    .0969011    .2958595          0          1
-------------+--------------------------------------------------------
wlogwage_ogr |      2906    2.896271    .5723385  -3.218876   5.560682
  any_under6 |      4066    .2166749    .4120299          0          1

. tab state;

      state |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |         89        2.19        2.19
         12 |         87        2.14        4.33
         13 |         59        1.45        5.78
         14 |         58        1.43        7.21
         15 |         69        1.70        8.90
         16 |        101        2.48       11.39
         21 |        155        3.81       15.20
         22 |         95        2.34       17.54
         23 |        126        3.10       20.63
         31 |        121        2.98       23.61
         32 |         78        1.92       25.53
         33 |        125        3.07       28.60
         34 |         99        2.43       31.04
         35 |         98        2.41       33.45
         41 |        124        3.05       36.50
         42 |         84        2.07       38.56
         43 |         69        1.70       40.26
         44 |         61        1.50       41.76
         45 |         67        1.65       43.41
         46 |         72        1.77       45.18
         47 |         59        1.45       46.63
         51 |         67        1.65       48.28
         52 |         99        2.43       50.71
         53 |         34        0.84       51.55
         54 |         93        2.29       53.84
         55 |         46        1.13       54.97
         56 |         68        1.67       56.64
         57 |         60        1.48       58.12
         58 |         79        1.94       60.06
         59 |        141        3.47       63.53
         61 |         75        1.84       65.37
         62 |         56        1.38       66.75
         63 |         37        0.91       67.66
         64 |         34        0.84       68.49
         71 |         30        0.74       69.23
         72 |         23        0.57       69.80
         73 |         35        0.86       70.66
         74 |        209        5.14       75.80
         81 |         32        0.79       76.59
         82 |         61        1.50       78.09
         83 |         51        1.25       79.34
         84 |        103        2.53       81.87
         85 |         30        0.74       82.61
         86 |         48        1.18       83.79
         87 |         51        1.25       85.05
         88 |         54        1.33       86.37
         91 |         80        1.97       88.34
         92 |         59        1.45       89.79
         93 |        314        7.72       97.52
         94 |         42        1.03       98.55
         95 |         59        1.45      100.00
------------+-----------------------------------
      Total |      4,066      100.00

. tab cbsa_size;

  cbsa_size |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,070       26.32       26.32
          2 |        349        8.58       34.90
          3 |        343        8.44       43.33
          4 |        432       10.62       53.96
          5 |        682       16.77       70.73
          6 |        655       16.11       86.84
          7 |        535       13.16      100.00
------------+-----------------------------------
      Total |      4,066      100.00

. corr weduc heduc w_age h_age wtwage htwage;
(obs=2988)

             |    weduc    heduc    w_age    h_age   wtwage   htwage
-------------+------------------------------------------------------
       weduc |   1.0000
       heduc |   0.6139   1.0000
       w_age |  -0.0569   0.0126   1.0000
       h_age |  -0.0825  -0.0035   0.8925   1.0000
      wtwage |   0.3360   0.2231   0.0441   0.0317   1.0000
      htwage |   0.1742   0.2977   0.0829   0.0657   0.1510   1.0000


. *from now on drop if wife is under 25 or over 55;
. drop if w_age<25;
(47 observations deleted)

. drop if w_age>55;
(679 observations deleted)

. table w_age , c (n weduc  mean h_age mean weduc );

-------------------------------------------------
    w_age |    N(weduc)  mean(h_age)  mean(weduc)
----------+--------------------------------------
       25 |          42       28.381      13.3333
       26 |          55      29.3455      14.0727
       27 |          66      28.7576           15
       28 |          79      30.6456      14.3038
       29 |          79      32.5823      14.5063
       30 |          91      33.2198      14.1538
       31 |         106      34.2547      14.7264
       32 |         107       34.514      14.3271
       33 |         106      35.8208      14.7358
       34 |         117      36.3504      14.3761
       35 |          95         38.2      14.2105
       36 |         111      38.3964      14.3874
       37 |         108         39.5      14.1111
       38 |         127      40.8898      14.4488
       39 |          98      42.0204      14.4388
       40 |         122      42.4426      14.2705
       41 |         111      42.9189      14.5856
       42 |         118      44.2627      14.3983
       43 |         116       44.569      13.9828
       44 |         110      45.9636      14.3727
       45 |         119      46.9496      14.0084
       46 |         120      48.6083      13.3167
       47 |         112      50.0982      14.6339
       48 |         123      50.3333      14.1301
       49 |         123      50.5935      13.8862
       50 |         161      51.8137       13.882
       51 |         148      52.2162       13.473
       52 |         110      53.8364      14.2545
       53 |         137       54.146      14.2774
       54 |         107      55.0467      13.8879
       55 |         116      55.9828      14.1034
-------------------------------------------------

.  *some H-W diffs;
. tab wifework husbandwork, row col;

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |      husbandwork
  wifework |         0          1 |     Total
-----------+----------------------+----------
         0 |         0        646 |       646 
           |      0.00     100.00 |    100.00 
           |      0.00      20.48 |     19.34 
-----------+----------------------+----------
         1 |       185      2,509 |     2,694 
           |      6.87      93.13 |    100.00 
           |    100.00      79.52 |     80.66 
-----------+----------------------+----------
     Total |       185      3,155 |     3,340 
           |      5.54      94.46 |    100.00 
           |    100.00     100.00 |    100.00 


. gen agegap=h_age-w_age;

. gen edgap=heduc-weduc;

. gen paygap=hwagesal-wwagesal;

. gen wagegap=htwage-wtwage;
(831 missing values generated)

. gen hrsgap=hannhrs-wannhrs;

. sum agegap edgap paygap hrsgap wagegap;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
      agegap |      3340    2.253293    4.658628        -21         27
       edgap |      3340   -.2083832    2.421141        -16         12
      paygap |      3340    28914.39    81394.45    -911488    1099999
      hrsgap |      3340     594.479    1247.845      -3900       5148
     wagegap |      2509    6.471194    31.28789     -391.1   389.4231

. corr agegap edgap paygap hrsgap wagegap;
(obs=2509)

             |   agegap    edgap   paygap   hrsgap  wagegap
-------------+---------------------------------------------
      agegap |   1.0000
       edgap |   0.0429   1.0000
      paygap |   0.0071   0.2247   1.0000
      hrsgap |   0.0005   0.0986   0.3489   1.0000
     wagegap |   0.0022   0.2035   0.8091   0.0321   1.0000


. *age profiles;
. table w_age, c( n wifework mean wifework mean wannhrs mean ownkidsu6 
> mean ownkidsu18);

--------------------------------------------------------------------------------
    w_age |  N(wifework)  mean(wife~k)  mean(wann~s)  mean(ownk~6)  mean(own~18)
----------+---------------------------------------------------------------------
       25 |           42       .690476       1149.36       .785714       .857143
       26 |           55       .818182       1402.55       .709091       1.07273
       27 |           66        .80303       1490.55       .787879       1.16667
       28 |           79       .810127       1352.72       .924051       1.27848
       29 |           79       .734177       1381.87       .746835       1.26582
       30 |           91       .802198       1362.89       1.02198       1.64835
       31 |          106       .830189       1521.45       .858491       1.43396
       32 |          107        .82243       1456.17       .897196       1.73832
       33 |          106       .764151       1309.57       .650943        1.5566
       34 |          117       .786325       1533.15       .726496       1.63248
       35 |           95            .8       1293.28       .705263       1.66316
       36 |          111       .756757       1330.41        .63964       1.82883
       37 |          108       .740741       1236.43       .416667       1.85185
       38 |          127       .732283       1236.92       .456693       1.64567
       39 |           98       .795918       1377.79       .387755       1.56122
       40 |          122       .860656       1587.26       .385246       1.68852
       41 |          111       .810811       1480.41       .369369       1.64865
       42 |          118       .872881       1685.39       .177966       1.42373
       43 |          116       .827586       1637.72       .155172       1.31897
       44 |          110       .781818       1372.89       .145455       1.42727
       45 |          119       .815126       1418.13       .109244       1.21008
       46 |          120       .841667       1523.03       .066667       .983333
       47 |          112       .883929       1695.35       .008929       .857143
       48 |          123       .796748       1454.67        .02439       .699187
       49 |          123       .845528       1585.28        .03252       .715447
       50 |          161       .813665       1538.07       .006211       .583851
       51 |          148       .810811       1512.76       .006757       .405405
       52 |          110       .818182       1493.11             0       .281818
       53 |          137       .810219       1446.75       .021898       .357664
       54 |          107       .785047       1551.61       .018692        .17757
       55 |          116       .836207       1656.62             0        .12931
--------------------------------------------------------------------------------

. table w_age if wifework==1, c( n wifework mean wannhrs mean wtwage mean wlogwage);

--------------------------------------------------------------------------
    w_age |    N(wifework)   mean(wannhrs)    mean(wtwage)  mean(wlogwage)
----------+---------------------------------------------------------------
       25 |             29         1664.59         14.5282        2.580028
       26 |             45         1714.22        18.52726        2.744507
       27 |             53         1856.15        18.15164        2.779815
       28 |             64         1669.77        15.96412        2.622462
       29 |             58         1882.21        20.33297        2.799663
       30 |             73         1698.95        21.82377        2.836552
       31 |             88         1832.66        22.26627        2.935779
       32 |             88         1770.57        20.48781        2.794204
       33 |             81         1713.75        20.83592        2.878471
       34 |             92         1949.76        23.93525        2.854227
       35 |             76         1616.61        19.89842        2.738653
       36 |             84         1758.05        24.65296         2.95121
       37 |             80         1669.18        27.07425        3.012369
       38 |             93         1689.13        21.15484        2.787447
       39 |             78         1731.06        23.57314        2.918575
       40 |            105         1844.25        19.88931        2.796478
       41 |             90         1825.84        21.48627          2.8329
       42 |            103         1930.83         21.9728        2.913223
       43 |             96         1978.91        23.29489         2.77265
       44 |             86         1756.02        20.09465        2.853459
       45 |             97         1739.77        22.26389        2.811879
       46 |            101         1809.53        19.82169        2.803668
       47 |             99         1917.97        20.89202        2.823513
       48 |             98         1825.76        20.21237        2.810964
       49 |            104          1874.9        20.81946        2.771729
       50 |            131          1890.3         20.2019        2.790731
       51 |            120         1865.73         23.4013        2.909495
       52 |             90         1824.91        21.04315        2.791311
       53 |            111         1785.63         24.3777        2.897235
       54 |             84         1976.45        27.19242        2.985523
       55 |             97         1981.11        27.33866        2.945165
--------------------------------------------------------------------------

.  *some new vars;
. gen wcollege=(weduc>=16);

. gen hcollege=(heduc>=16);

. tab wrgroup hrgroup, row col;

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |                        hrgroup
   wrgroup |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
         1 |     2,352         17         53         16         30 |     2,468 
           |     95.30       0.69       2.15       0.65       1.22 |    100.00 
           |     94.57       9.39      13.15       8.25      40.00 |     73.89 
-----------+-------------------------------------------------------+----------
         2 |         8        155          2          0          1 |       166 
           |      4.82      93.37       1.20       0.00       0.60 |    100.00 
           |      0.32      85.64       0.50       0.00       1.33 |      4.97 
-----------+-------------------------------------------------------+----------
         3 |        61          6        339          2          4 |       412 
           |     14.81       1.46      82.28       0.49       0.97 |    100.00 
           |      2.45       3.31      84.12       1.03       5.33 |     12.34 
-----------+-------------------------------------------------------+----------
         4 |        38          1          2        171          3 |       215 
           |     17.67       0.47       0.93      79.53       1.40 |    100.00 
           |      1.53       0.55       0.50      88.14       4.00 |      6.44 
-----------+-------------------------------------------------------+----------
         5 |        28          2          7          5         37 |        79 
           |     35.44       2.53       8.86       6.33      46.84 |    100.00 
           |      1.13       1.10       1.74       2.58      49.33 |      2.37 
-----------+-------------------------------------------------------+----------
     Total |     2,487        181        403        194         75 |     3,340 
           |     74.46       5.42      12.07       5.81       2.25 |    100.00 
           |    100.00     100.00     100.00     100.00     100.00 |    100.00 


. tab wblack hblack , row col;

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |        hblack
    wblack |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,148         26 |     3,174 
           |     99.18       0.82 |    100.00 
           |     99.65      14.36 |     95.03 
-----------+----------------------+----------
         1 |        11        155 |       166 
           |      6.63      93.37 |    100.00 
           |      0.35      85.64 |      4.97 
-----------+----------------------+----------
     Total |     3,159        181 |     3,340 
           |     94.58       5.42 |    100.00 
           |    100.00     100.00 |    100.00 


. tab whispanic hhispanic, row col;

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |       hhispanic
 whispanic |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,864         64 |     2,928 
           |     97.81       2.19 |    100.00 
           |     97.51      15.88 |     87.66 
-----------+----------------------+----------
         1 |        73        339 |       412 
           |     17.72      82.28 |    100.00 
           |      2.49      84.12 |     12.34 
-----------+----------------------+----------
     Total |     2,937        403 |     3,340 
           |     87.93      12.07 |    100.00 
           |    100.00     100.00 |    100.00 


. tab wcollege hcollege , row col;

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |       hcollege
  wcollege |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,620        331 |     1,951 
           |     83.03      16.97 |    100.00 
           |     78.07      26.17 |     58.41 
-----------+----------------------+----------
         1 |       455        934 |     1,389 
           |     32.76      67.24 |    100.00 
           |     21.93      73.83 |     41.59 
-----------+----------------------+----------
     Total |     2,075      1,265 |     3,340 
           |     62.13      37.87 |    100.00 
           |    100.00     100.00 |    100.00 


. gen wexp=w_age-weduc-6;

. replace wexp=0 if wexp<0;
(1 real change made)

. gen wexp2=wexp*wexp/100;

. gen wexp3=wexp*wexp*wexp/1000;

. drop wlogwage_ogr;

. replace wwage_ogr=4 if wwage_ogr>0 & wwage_ogr<4;
(13 real changes made)

. replace wwage_ogr=400 if wwage_ogr>400;
(938 real changes made)

. gen wlogwage_ogr=log(wwage_ogr);

. gen work_and_wage=0;

. replace work_and_wage=1 if wifework==1 & wife_wage_ogr==1;
(2373 real changes made)

. sum wwage_ogr wlogwage_ogr wlogwage wannhrs hwagesal wtwage weduc if wifework==1;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
   wwage_ogr |      2694      66.609    123.3931          4        400
wlogwage_ogr |      2694    3.275662    1.125811   1.386294   5.991465
    wlogwage |      2694    2.839735    .6805533   1.386294   5.991465
     wannhrs |      2694    1819.085    642.3766          1       4653
    hwagesal |      2694    57311.69    64385.31          0    1099999
-------------+--------------------------------------------------------
      wtwage |      2694    21.83915    22.01362          4        400
       weduc |      2694    14.42613    2.638147          0         20

. sum wwage_ogr wlogwage_ogr wlogwage wannhrs hwagesal wtwage weduc if work_and_wage==1;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
   wwage_ogr |      2373    21.51059    14.48744          4        260
wlogwage_ogr |      2373    2.908291    .5530135   1.386294   5.560682
    wlogwage |      2373    2.904924    .6092024   1.386294   5.991465
     wannhrs |      2373    1880.812    585.2939          1       4653
    hwagesal |      2373    55808.26    63944.42          0    1099999
-------------+--------------------------------------------------------
      wtwage |      2373     22.3412    20.27238          4        400
       weduc |      2373    14.48968    2.642483          0         20

. sum wwage_ogr wlogwage_ogr wlogwage wannhrs hwagesal wtwage weduc if wifework==1 & wife_wage_ogr==0;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
   wwage_ogr |       321         400           0        400        400
wlogwage_ogr |       321    5.991465           0   5.991465   5.991465
    wlogwage |       321     2.35782    .9392848   1.386294   5.991465
     wannhrs |       321     1362.76    834.4202          5       3640
    hwagesal |       321     68425.9     66611.9          0     600000
-------------+--------------------------------------------------------
      wtwage |       321     18.1277    31.87802          4        400
       weduc |       321    13.95639    2.561365          3         20

. *probit model of work+validOGR wage;
. probit work_and_wage weduc wcollege wexp wexp2 wexp3 wblack whispanic wimm
>        wgen2 ownkidsu6 any_under6 hwagesal heduc hcollege himm hgen2 h_age;

Iteration 0:   log likelihood = -2009.7521  
Iteration 1:   log likelihood = -1877.9991  
Iteration 2:   log likelihood = -1877.4315  
Iteration 3:   log likelihood = -1877.4314  

Probit regression                                 Number of obs   =       3340
                                                  LR chi2(17)     =     264.64
                                                  Prob > chi2     =     0.0000
Log likelihood = -1877.4314                       Pseudo R2       =     0.0658

-------------------------------------------------------------------------------
work_and_wage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
        weduc |   .0938225   .0195166     4.81   0.000     .0555708    .1320743
     wcollege |   .1033206   .0929739     1.11   0.266     -.078905    .2855462
         wexp |   .0022788   .0356355     0.06   0.949    -.0675656    .0721231
        wexp2 |  -.1408701   .1798662    -0.78   0.434    -.4934014    .2116612
        wexp3 |   .0313744   .0279593     1.12   0.262    -.0234247    .0861736
       wblack |   .0655658   .1111192     0.59   0.555    -.1522238    .2833555
    whispanic |  -.1113965   .0855296    -1.30   0.193    -.2790314    .0562385
         wimm |  -.2642558   .0989723    -2.67   0.008     -.458238   -.0702736
        wgen2 |   .0707645   .1082958     0.65   0.513    -.1414914    .2830203
    ownkidsu6 |  -.1809219   .0790833    -2.29   0.022    -.3359224   -.0259214
   any_under6 |  -.1394665   .1233409    -1.13   0.258    -.3812102    .1022771
     hwagesal |  -2.54e-06   3.51e-07    -7.25   0.000    -3.23e-06   -1.86e-06
        heduc |  -.0155962   .0165285    -0.94   0.345    -.0479915     .016799
     hcollege |  -.1455138   .0901809    -1.61   0.107     -.322265    .0312374
         himm |  -.0282757   .1013865    -0.28   0.780    -.2269897    .1704382
        hgen2 |   .0293868   .1107491     0.27   0.791    -.1876774    .2464509
        h_age |   .0081855   .0051216     1.60   0.110    -.0018526    .0182236
        _cons |  -.3201643   .3615624    -0.89   0.376    -1.028814    .3884851
-------------------------------------------------------------------------------

. predict pwork1;
(option pr assumed; Pr(work_and_wage))

. gen lambda1 = normalden(invnormal(pwork1))/pwork1;

. sum lambda1 if work_and_wage==0;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
     lambda1 |       967    .5696497    .2315655   .1492069   2.621254

. sum lambda1 if work_and_wage==1;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
     lambda1 |      2373    .4478074    .1834445   .1115173   2.562097

. corr work_and_wage pwork1 lambda1;
(obs=3340)

             | work_a~e   pwork1  lambda1
-------------+---------------------------
work_and_w~e |   1.0000
      pwork1 |   0.2855   1.0000
     lambda1 |  -0.2682  -0.9842   1.0000


. reg wlogwage weduc wcollege wexp wexp2 wexp3 wblack whispanic wimm
>     ownkidsu6 any_under6 ;

      Source |       SS       df       MS              Number of obs =    2694
-------------+------------------------------           F( 10,  2683) =   69.95
       Model |  257.938169    10  25.7938169           Prob > F      =  0.0000
    Residual |  989.332427  2683  .368741121           R-squared     =  0.2068
-------------+------------------------------           Adj R-squared =  0.2038
       Total |   1247.2706  2693  .463152839           Root MSE      =  .60724

------------------------------------------------------------------------------
    wlogwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       weduc |   .1151357   .0089395    12.88   0.000     .0976067    .1326647
    wcollege |    .067602    .043784     1.54   0.123    -.0182519    .1534559
        wexp |   .0610294    .017046     3.58   0.000     .0276048     .094454
       wexp2 |  -.3097726   .0887194    -3.49   0.000     -.483738   -.1358071
       wexp3 |   .0521198    .014022     3.72   0.000     .0246248    .0796147
      wblack |  -.0369857   .0535813    -0.69   0.490    -.1420505     .068079
   whispanic |  -.0383646   .0422138    -0.91   0.364    -.1211395    .0444103
        wimm |    -.02029   .0356972    -0.57   0.570    -.0902869    .0497068
   ownkidsu6 |  -.0391381    .046216    -0.85   0.397    -.1297606    .0514844
  any_under6 |   .1289473   .0685195     1.88   0.060     -.005409    .2633036
       _cons |    .728168   .1689047     4.31   0.000     .3969715    1.059365
------------------------------------------------------------------------------

. reg wlogwage weduc wcollege wexp wexp2 wexp3 wblack whispanic wimm
>     ownkidsu6 any_under6 if work_and_wage==1;

      Source |       SS       df       MS              Number of obs =    2373
-------------+------------------------------           F( 10,  2362) =   78.24
       Model |  219.035376    10  21.9035376           Prob > F      =  0.0000
    Residual |  661.279208  2362  .279965795           R-squared     =  0.2488
-------------+------------------------------           Adj R-squared =  0.2456
       Total |  880.314583  2372  .371127565           Root MSE      =  .52912

------------------------------------------------------------------------------
    wlogwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       weduc |   .1186135      .0083    14.29   0.000     .1023376    .1348894
    wcollege |   .0371441   .0406441     0.91   0.361    -.0425577    .1168459
        wexp |    .078094   .0155888     5.01   0.000     .0475247    .1086632
       wexp2 |  -.3750109   .0812144    -4.62   0.000    -.5342699    -.215752
       wexp3 |   .0594979   .0128444     4.63   0.000     .0343106    .0846853
      wblack |  -.0550525   .0496942    -1.11   0.268    -.1525012    .0423963
   whispanic |  -.0201261    .039523    -0.51   0.611    -.0976295    .0573773
        wimm |  -.0216589     .03298    -0.66   0.511    -.0863316    .0430139
   ownkidsu6 |  -.0048804   .0446087    -0.11   0.913    -.0923566    .0825958
  any_under6 |   .1005767   .0654636     1.54   0.125    -.0277953    .2289488
       _cons |   .6216571   .1564038     3.97   0.000     .3149541    .9283601
------------------------------------------------------------------------------

. reg wlogwage weduc wcollege wexp wexp2 wexp3 wblack whispanic wimm
>     ownkidsu6 any_under6 lambda1 if work_and_wage==1;

      Source |       SS       df       MS              Number of obs =    2373
-------------+------------------------------           F( 11,  2361) =   71.48
       Model |  219.931008    11   19.993728           Prob > F      =  0.0000
    Residual |  660.383575  2361   .27970503           R-squared     =  0.2498
-------------+------------------------------           Adj R-squared =  0.2463
       Total |  880.314583  2372  .371127565           Root MSE      =  .52887

------------------------------------------------------------------------------
    wlogwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       weduc |   .1252457   .0090864    13.78   0.000     .1074277    .1430638
    wcollege |   .0368313   .0406255     0.91   0.365    -.0428342    .1164967
        wexp |   .0787635   .0155861     5.05   0.000     .0481997    .1093274
       wexp2 |  -.3857926   .0813999    -4.74   0.000    -.5454153   -.2261699
       wexp3 |   .0619385   .0129106     4.80   0.000     .0366212    .0872558
      wblack |  -.0503364   .0497409    -1.01   0.312    -.1478768     .047204
   whispanic |  -.0297947   .0398724    -0.75   0.455    -.1079832    .0483938
        wimm |   -.047949   .0360904    -1.33   0.184    -.1187212    .0228232
   ownkidsu6 |  -.0190525   .0452858    -0.42   0.674    -.1078566    .0697516
  any_under6 |   .0892655   .0657377     1.36   0.175    -.0396441    .2181751
     lambda1 |   .1686261   .0942345     1.79   0.074    -.0161649    .3534171
       _cons |   .4688927   .1781221     2.63   0.009     .1196007    .8181846
------------------------------------------------------------------------------

. reg wlogwage_ogr weduc wcollege wexp wexp2 wexp3 wblack whispanic wimm
>     ownkidsu6 any_under6 if work_and_wage==1;

      Source |       SS       df       MS              Number of obs =    2373
-------------+------------------------------           F( 10,  2362) =   77.52
       Model |  179.246168    10  17.9246168           Prob > F      =  0.0000
    Residual |  546.168194  2362  .231231242           R-squared     =  0.2471
-------------+------------------------------           Adj R-squared =  0.2439
       Total |  725.414362  2372   .30582393           Root MSE      =  .48087

------------------------------------------------------------------------------
wlogwage_ogr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       weduc |   .0914047    .007543    12.12   0.000      .076613    .1061963
    wcollege |   .1196028   .0369376     3.24   0.001     .0471694    .1920363
        wexp |   .0519063   .0141672     3.66   0.000     .0241248    .0796878
       wexp2 |  -.2250964   .0738081    -3.05   0.002    -.3698317    -.080361
       wexp3 |   .0337882    .011673     2.89   0.004     .0108978    .0566786
      wblack |   -.065481   .0451623    -1.45   0.147    -.1540429     .023081
   whispanic |  -.0011531   .0359187    -0.03   0.974    -.0715885    .0692824
        wimm |  -.0699302   .0299724    -2.33   0.020    -.1287051   -.0111553
   ownkidsu6 |  -.0421012   .0405406    -1.04   0.299    -.1216001    .0373976
  any_under6 |   .1041021   .0594936     1.75   0.080     -.012563    .2207673
       _cons |    1.13297   .1421406     7.97   0.000     .8542366    1.411703
------------------------------------------------------------------------------

. reg wlogwage_ogr weduc wcollege wexp wexp2 wexp3 wblack whispanic wimm
>     ownkidsu6 any_under6 lambda1 if work_and_wage==1;

      Source |       SS       df       MS              Number of obs =    2373
-------------+------------------------------           F( 11,  2361) =   72.00
       Model |  182.221612    11  16.5656011           Prob > F      =  0.0000
    Residual |   543.19275  2361  .230068933           R-squared     =  0.2512
-------------+------------------------------           Adj R-squared =  0.2477
       Total |  725.414362  2372   .30582393           Root MSE      =  .47966

------------------------------------------------------------------------------
wlogwage_ogr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       weduc |   .1034931   .0082408    12.56   0.000     .0873332    .1196531
    wcollege |   .1190327    .036845     3.23   0.001     .0467809    .1912845
        wexp |   .0531267   .0141356     3.76   0.000     .0254071    .0808463
       wexp2 |  -.2447479   .0738249    -3.32   0.001    -.3895162   -.0999796
       wexp3 |   .0382366   .0117092     3.27   0.001     .0152753    .0611979
      wblack |   -.056885   .0451121    -1.26   0.207    -.1453484    .0315784
   whispanic |  -.0187758   .0361619    -0.52   0.604    -.0896881    .0521366
        wimm |  -.1178488   .0327319    -3.60   0.000     -.182035   -.0536626
   ownkidsu6 |  -.0679326   .0410715    -1.65   0.098    -.1484726    .0126075
  any_under6 |   .0834854   .0596202     1.40   0.162     -.033428    .2003987
     lambda1 |   .3073518   .0854651     3.60   0.000     .1397573    .4749463
       _cons |   .8545289   .1615462     5.29   0.000     .5377419    1.171316
------------------------------------------------------------------------------

. reg wannhrs wlogwage hwagesal if work_and_wage==1;

      Source |       SS       df       MS              Number of obs =    2373
-------------+------------------------------           F(  2,  2370) =   15.40
       Model |  10427324.8     2   5213662.4           Prob > F      =  0.0000
    Residual |   802146347  2370  338458.374           R-squared     =  0.0128
-------------+------------------------------           Adj R-squared =  0.0120
       Total |   812573672  2372  342569.001           Root MSE      =  581.77

------------------------------------------------------------------------------
     wannhrs |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    wlogwage |   108.0204    19.8114     5.45   0.000     69.17092    146.8699
    hwagesal |  -.0003412   .0001887    -1.81   0.071    -.0007113     .000029
       _cons |    1586.06   58.24411    27.23   0.000     1471.846    1700.275
------------------------------------------------------------------------------

. reg wannhrs wlogwage hwagesal lambda1 if work_and_wage==1;

      Source |       SS       df       MS              Number of obs =    2373
-------------+------------------------------           F(  3,  2369) =   22.52
       Model |  22527451.1     3  7509150.37           Prob > F      =  0.0000
    Residual |   790046220  2369   333493.55           R-squared     =  0.0277
-------------+------------------------------           Adj R-squared =  0.0265
       Total |   812573672  2372  342569.001           Root MSE      =  577.49

------------------------------------------------------------------------------
     wannhrs |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    wlogwage |   64.19953   20.96805     3.06   0.002      23.0819    105.3172
    hwagesal |   .0002773   .0002136     1.30   0.194    -.0001416    .0006962
     lambda1 |  -458.5541   76.12711    -6.02   0.000    -607.8368   -309.2714
       _cons |   1884.186   76.10663    24.76   0.000     1734.944    2033.429
------------------------------------------------------------------------------

. reg wannhrs wlogwage_ogr hwagesal if work_and_wage==1;

      Source |       SS       df       MS              Number of obs =    2373
-------------+------------------------------           F(  2,  2370) =   45.03
       Model |  29747878.8     2  14873939.4           Prob > F      =  0.0000
    Residual |   782825793  2370  330306.242           R-squared     =  0.0366
-------------+------------------------------           Adj R-squared =  0.0358
       Total |   812573672  2372  342569.001           Root MSE      =  574.72

------------------------------------------------------------------------------
     wannhrs |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
wlogwage_ogr |   203.9122   21.62004     9.43   0.000      161.516    246.3083
    hwagesal |  -.0004777    .000187    -2.55   0.011    -.0008444    -.000111
       _cons |   1314.436   63.17109    20.81   0.000      1190.56    1438.313
------------------------------------------------------------------------------

. reg wannhrs wlogwage_ogr hwagesal lambda1 if work_and_wage==1;

      Source |       SS       df       MS              Number of obs =    2373
-------------+------------------------------           F(  3,  2369) =   37.34
       Model |  36688425.4     3  12229475.1           Prob > F      =  0.0000
    Residual |   775885246  2369  327515.933           R-squared     =  0.0452
-------------+------------------------------           Adj R-squared =  0.0439
       Total |   812573672  2372  342569.001           Root MSE      =  572.29

------------------------------------------------------------------------------
     wannhrs |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
wlogwage_ogr |   166.9391   22.97792     7.27   0.000     121.8802     211.998
    hwagesal |  -2.64e-06   .0002129    -0.01   0.990    -.0004201    .0004148
     lambda1 |   -347.646   75.51906    -4.60   0.000    -495.7363   -199.5557
       _cons |   1551.131   81.24404    19.09   0.000     1391.814    1710.448
------------------------------------------------------------------------------

. reg wannhrs wlogwage_ogr hwagesal weduc if work_and_wage==1;

      Source |       SS       df       MS              Number of obs =    2373
-------------+------------------------------           F(  3,  2369) =   31.13
       Model |  30814979.2     3  10271659.7           Prob > F      =  0.0000
    Residual |   781758692  2369  329995.227           R-squared     =  0.0379
-------------+------------------------------           Adj R-squared =  0.0367
       Total |   812573672  2372  342569.001           Root MSE      =  574.45

------------------------------------------------------------------------------
     wannhrs |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
wlogwage_ogr |   183.8367   24.32322     7.56   0.000     136.1397    231.5337
    hwagesal |  -.0005225   .0001885    -2.77   0.006    -.0008922   -.0001528
       weduc |   9.204194   5.118432     1.80   0.072    -.8328766    19.24126
       _cons |   1241.955   74.90963    16.58   0.000      1095.06     1388.85
------------------------------------------------------------------------------

. reg wannhrs wlogwage_ogr hwagesal weduc lambda1 if work_and_wage==1;

      Source |       SS       df       MS              Number of obs =    2373
-------------+------------------------------           F(  4,  2368) =   28.98
       Model |  37920032.1     4  9480008.02           Prob > F      =  0.0000
    Residual |   774653639  2368  327134.138           R-squared     =  0.0467
-------------+------------------------------           Adj R-squared =  0.0451
       Total |   812573672  2372  342569.001           Root MSE      =  571.96

------------------------------------------------------------------------------
     wannhrs |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
wlogwage_ogr |   181.8804   24.22118     7.51   0.000     134.3835    229.3773
    hwagesal |   .0002577   .0002515     1.02   0.306    -.0002355    .0007509
       weduc |  -13.75246   7.087732    -1.94   0.052    -27.65126    .1463443
     lambda1 |  -489.1987   104.9698    -4.66   0.000     -695.041   -283.3563
       _cons |   1755.805   133.1162    13.19   0.000     1494.768    2016.841
------------------------------------------------------------------------------

. 
end of do-file

. exit, clear
