-----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  G:\My Drive\Policy_Eval_2019\stata\ch13.log
  log type:  text
 opened on:   7 Mar 2019, 14:27:51

. use fertil1.dta
no; data in memory would be lost
r(4);

. use fertil1.dta, clear

. reg kids educ age black, r

Linear regression                               Number of obs     =      1,129
                                                F(3, 1125)        =      23.91
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0774
                                                Root MSE          =     1.5907

------------------------------------------------------------------------------
             |               Robust
        kids |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |  -.1333276   .0210833    -6.32   0.000    -.1746947   -.0919605
         age |   .0248763   .0080751     3.08   0.002     .0090324    .0407201
       black |   .8460796   .2011772     4.21   0.000     .4513549    1.240804
       _cons |   3.281504   .4543962     7.22   0.000     2.389945    4.173064
------------------------------------------------------------------------------

. reg kids educ age black y74 y76 y78 y80 y82 y84 , r

Linear regression                               Number of obs     =      1,129
                                                F(9, 1119)        =      13.82
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1068
                                                Root MSE          =     1.5694

------------------------------------------------------------------------------
             |               Robust
        kids |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |  -.1186924   .0209937    -5.65   0.000    -.1598839   -.0775009
         age |   .0197379   .0081627     2.42   0.016     .0037219    .0357539
       black |   .9583815   .2010176     4.77   0.000     .5639675    1.352795
         y74 |   .2399946   .1881286     1.28   0.202    -.1291299    .6091191
         y76 |  -.1503681   .1979404    -0.76   0.448    -.5387443    .2380081
         y78 |  -.1003948   .1979514    -0.51   0.612    -.4887925    .2880029
         y80 |  -.0872873    .194787    -0.45   0.654    -.4694763    .2949016
         y82 |   -.572119   .1892151    -3.02   0.003    -.9433753   -.2008627
         y84 |  -.5809789   .1877607    -3.09   0.002    -.9493816   -.2125762
       _cons |   3.502164   .4738611     7.39   0.000     2.572408    4.431921
------------------------------------------------------------------------------

. ** dif in dif, using workman's comp examples

. use injury, clear

. keep if ky==1
(1,524 observations deleted)

. reg ldurat afchnge highearn afhigh, r

Linear regression                               Number of obs     =      5,626
                                                F(3, 5622)        =      38.97
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0207
                                                Root MSE          =     1.2692

------------------------------------------------------------------------------
             |               Robust
      ldurat |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     afchnge |   .0076573   .0440344     0.17   0.862     -.078667    .0939817
    highearn |   .2564785   .0473887     5.41   0.000     .1635785    .3493786
      afhigh |   .1906012    .068982     2.76   0.006     .0553699    .3258324
       _cons |   1.125615   .0296226    38.00   0.000     1.067544    1.183687
------------------------------------------------------------------------------

. reg ldurat afchnge highearn afhigh male married, r

Linear regression                               Number of obs     =      5,362
                                                F(5, 5356)        =      26.37
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0247
                                                Root MSE          =     1.2599

------------------------------------------------------------------------------
             |               Robust
      ldurat |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     afchnge |   .0119027   .0449044     0.27   0.791    -.0761281    .0999335
    highearn |   .2264434   .0505081     4.48   0.000      .127427    .3254599
      afhigh |   .2244848    .070214     3.20   0.001     .0868367    .3621329
        male |  -.0837481   .0439567    -1.91   0.057    -.1699211    .0024248
     married |   .1346087   .0379958     3.54   0.000     .0601214    .2090959
       _cons |   1.097571   .0475341    23.09   0.000     1.004385    1.190757
------------------------------------------------------------------------------

. log close
      name:  <unnamed>
       log:  G:\My Drive\Policy_Eval_2019\stata\ch13.log
  log type:  text
 closed on:   7 Mar 2019, 15:13:53
-----------------------------------------------------------------------------------
-----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  G:\My Drive\Policy_Eval_2019\stata\ch13.log
  log type:  text
 opened on:  19 Mar 2019, 13:58:33

. use kielmc.dta

. ** ch13 #c3

. reg lprice y81 ldist y81ldist, r

Linear regression                               Number of obs     =        321
                                                F(3, 317)         =      82.51
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3958
                                                Root MSE          =      .3422

------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         y81 |  -.0113238   .7619969    -0.01   0.988    -1.510534    1.487887
       ldist |    .316688   .0375356     8.44   0.000     .2428376    .3905384
    y81ldist |   .0481875   .0765745     0.63   0.530     -.102471    .1988461
       _cons |   8.058478   .3747941    21.50   0.000     7.321079    8.795876
------------------------------------------------------------------------------

. reg lprice y81 ldist y81ldist age agesq rooms baths lintst lland larea, r

Linear regression                               Number of obs     =        321
                                                F(10, 310)        =     130.95
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7870
                                                Root MSE          =     .20545

------------------------------------------------------------------------------
             |               Robust
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         y81 |  -.2254593   .5031342    -0.45   0.654    -1.215449    .7645308
       ldist |   .0009216   .0461653     0.02   0.984    -.0899154    .0917587
    y81ldist |    .062468   .0505521     1.24   0.217    -.0370005    .1619366
         age |  -.0080074   .0016001    -5.00   0.000    -.0111559    -.004859
       agesq |   .0000357   .0000107     3.35   0.001     .0000147    .0000567
       rooms |   .0461389   .0174623     2.64   0.009     .0117793    .0804985
       baths |    .101048   .0277473     3.64   0.000     .0464512    .1556448
      lintst |  -.0599756   .0372422    -1.61   0.108    -.1332551     .013304
       lland |   .0953427   .0334786     2.85   0.005     .0294687    .1612168
       larea |   .3507425   .0630756     5.56   0.000      .226632     .474853
       _cons |   7.673861   .5334296    14.39   0.000     6.624261    8.723462
------------------------------------------------------------------------------

. ** controls explain why houses closer to incinerator before it was built were mor
> e costly. they were nicer.

. ** now panel data!

. use crime2c

. reg clcrmrte cunem, r

Linear regression                               Number of obs     =         46
                                                F(1, 44)          =       7.48
                                                Prob > F          =     0.0090
                                                R-squared         =     0.1147
                                                Root MSE          =      .1811

------------------------------------------------------------------------------
             |               Robust
    clcrmrte |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       cunem |   .0189356   .0069233     2.74   0.009     .0049826    .0328885
       _cons |   .1155626   .0433426     2.67   0.011     .0282114    .2029138
------------------------------------------------------------------------------

. ** a one percentage point increas in unemployment is associated with a 1.9% incre
> ase in crime rate (because it's log crime rate)

. ** compare to OLS:  reg lcrmrte unem d87, r

. reg lcrmrte unem d87, r

Linear regression                               Number of obs     =         92
                                                F(2, 89)          =       0.37
                                                Prob > F          =     0.6903
                                                R-squared         =     0.0070
                                                Root MSE          =     .28595

------------------------------------------------------------------------------
             |               Robust
     lcrmrte |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        unem |   .0056123   .0098411     0.57   0.570    -.0139419    .0251664
         d87 |   .0600681   .0704873     0.85   0.396    -.0799887    .2001249
       _cons |    4.49762   .1060132    42.43   0.000     4.286974    4.708265
------------------------------------------------------------------------------

. ** gives different result, probably has OVB that we took out with FD

. ** or, could use fixed effects, which controls for the ai component directly

. ** create dummies:

. xi i.code
i.code            _Icode_1-46         (naturally coded; _Icode_1 omitted)

. reg lcrmrte unem d87 _I*, r

Linear regression                               Number of obs     =         92
                                                F(47, 44)         =     169.83
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9015
                                                Root MSE          =     .12806

------------------------------------------------------------------------------
             |               Robust
     lcrmrte |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        unem |   .0189356   .0069233     2.74   0.009     .0049827    .0328885
         d87 |   .1155627   .0433425     2.67   0.011     .0282115    .2029139
    _Icode_2 |   .2190112   .0688959     3.18   0.003     .0801607    .3578617
    _Icode_3 |   .0763108   .0851917     0.90   0.375    -.0953819    .2480034
    _Icode_4 |   .1175126   .0566406     2.07   0.044     .0033609    .2316643
    _Icode_5 |   .3037296    .063344     4.79   0.000     .1760682     .431391
    _Icode_6 |   .4648162   .0983883     4.72   0.000     .2665276    .6631049
    _Icode_7 |   .0454289   .0827632     0.55   0.586    -.1213693    .2122272
    _Icode_8 |   .1521436   .1615352     0.94   0.351    -.1734091    .4776964
    _Icode_9 |  -.1619821   .2570234    -0.63   0.532    -.6799786    .3560145
   _Icode_10 |    .186697   .0706236     2.64   0.011     .0443644    .3290296
   _Icode_11 |  -.0212128   .0622268    -0.34   0.735    -.1466227     .104197
   _Icode_12 |   .3273735   .1748856     1.87   0.068    -.0250852    .6798322
   _Icode_13 |   .8395303   .0484621    17.32   0.000     .7418614    .9371992
   _Icode_14 |   .1075541   .0476445     2.26   0.029     .0115328    .2035753
   _Icode_15 |   .3707684   .0526049     7.05   0.000     .2647501    .4767866
   _Icode_16 |   .6613416   .0607861    10.88   0.000     .5388353     .783848
   _Icode_17 |   .6818842   .1481644     4.60   0.000     .3832784      .98049
   _Icode_18 |   .2173021   .1405157     1.55   0.129    -.0658888    .5004929
   _Icode_19 |   .7144824    .118522     6.03   0.000     .4756169    .9533478
   _Icode_20 |    .653544   .0881648     7.41   0.000     .4758596    .8312284
   _Icode_21 |  -.0909414   .1152467    -0.79   0.434    -.3232058    .1413231
   _Icode_22 |  -.0627204   .0895448    -0.70   0.487    -.2431861    .1177452
   _Icode_23 |   .1345696   .0614304     2.19   0.034     .0107648    .2583743
   _Icode_24 |   .4122741   .0879375     4.69   0.000     .2350479    .5895004
   _Icode_25 |   .4383128   .0931463     4.71   0.000     .2505888    .6260369
   _Icode_26 |   .1594994   .1066659     1.50   0.142    -.0554716    .3744705
   _Icode_27 |   .3710204   .0839174     4.42   0.000      .201896    .5401447
   _Icode_28 |   .4044615    .137691     2.94   0.005     .1269634    .6819596
   _Icode_29 |  -.0438238   .0663252    -0.66   0.512    -.1774934    .0898458
   _Icode_30 |  -.1583893   .0859552    -1.84   0.072    -.3316206     .014842
   _Icode_31 |   .3301764   .0856408     3.86   0.000     .1575787    .5027741
   _Icode_32 |   .0339341   .0972022     0.35   0.729    -.1619641    .2298323
   _Icode_33 |    .102391   .0799958     1.28   0.207      -.05883    .2636119
   _Icode_34 |   .1845051   .0507166     3.64   0.001     .0822926    .2867177
   _Icode_35 |   .3858055   .0623302     6.19   0.000     .2601873    .5114238
   _Icode_36 |   .3971872   .1120055     3.55   0.001     .1714549    .6229194
   _Icode_37 |   .6728158    .130829     5.14   0.000     .4091473    .9364843
   _Icode_38 |  -.0259142   .0584665    -0.44   0.660    -.1437457    .0919173
   _Icode_39 |   .3637119   .1354482     2.69   0.010      .090734    .6366898
   _Icode_40 |   .1420073   .0572914     2.48   0.017      .026544    .2574706
   _Icode_41 |   .6445754   .1044438     6.17   0.000     .4340828    .8550679
   _Icode_42 |   .6510709   .1917597     3.40   0.001     .2646047    1.037537
   _Icode_43 |   .4743111    .077693     6.10   0.000     .3177312    .6308909
   _Icode_44 |   .0312683    .087644     0.36   0.723    -.1453665    .2079031
   _Icode_45 |  -.2819986   .0751841    -3.75   0.001    -.4335222   -.1304751
   _Icode_46 |  -.0081293   .1042543    -0.08   0.938    -.2182401    .2019815
       _cons |   4.111092   .0765389    53.71   0.000     3.956838    4.265346
------------------------------------------------------------------------------

. ** get stata to put fixed effects in for us:

. xtreg lcrmrte unem d87, i(code) r fe

Fixed-effects (within) regression               Number of obs     =         92
Group variable: code                            Number of groups  =         46

R-sq:                                           Obs per group:
     within  = 0.1471                                         min =          2
     between = 0.0008                                         avg =        2.0
     overall = 0.0051                                         max =          2

                                                F(2,45)           =       4.06
corr(u_i, Xb)  = -0.1222                        Prob > F          =     0.0239

                                  (Std. Err. adjusted for 46 clusters in code)
------------------------------------------------------------------------------
             |               Robust
     lcrmrte |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        unem |   .0189356   .0069224     2.74   0.009     .0049932     .032878
         d87 |   .1155627   .0433371     2.67   0.011     .0282772    .2028482
       _cons |   4.363662   .0736576    59.24   0.000     4.215308    4.512016
-------------+----------------------------------------------------------------
     sigma_u |  .27221473
     sigma_e |  .12805783
         rho |  .81879704   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. ** do with >2 time periods:

. use crime4.dta

. ** first do FD:

. reg clcrmrte clpolpc, r

Linear regression                               Number of obs     =        540
                                                F(1, 538)         =      10.66
                                                Prob > F          =     0.0012
                                                R-squared         =     0.1274
                                                Root MSE          =     .18974

------------------------------------------------------------------------------
             |               Robust
    clcrmrte |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     clpolpc |   .2680364   .0820805     3.27   0.001     .1067987     .429274
       _cons |  -.0014665   .0082527    -0.18   0.859    -.0176779    .0147449
------------------------------------------------------------------------------

. ** a 1% increase in police per capita is assoc with a .27% increase in crime

. ** do as FE:

. xtreg lcrmrte lpolpc d82-d87, i(county) r fe

Fixed-effects (within) regression               Number of obs     =        630
Group variable: county                          Number of groups  =         90

R-sq:                                           Obs per group:
     within  = 0.2246                                         min =          7
     between = 0.0129                                         avg =        7.0
     overall = 0.0289                                         max =          7

                                                F(7,89)           =      12.40
corr(u_i, Xb)  = -0.0723                        Prob > F          =     0.0000

                                (Std. Err. adjusted for 90 clusters in county)
------------------------------------------------------------------------------
             |               Robust
     lcrmrte |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      lpolpc |   .2389517   .0822358     2.91   0.005     .0755509    .4023526
         d82 |    .000735   .0163468     0.04   0.964    -.0317458    .0332157
         d83 |  -.0903975   .0233366    -3.87   0.000    -.1367669   -.0440281
         d84 |  -.1449679   .0257462    -5.63   0.000     -.196125   -.0938107
         d85 |  -.1444484   .0289751    -4.99   0.000    -.2020213   -.0868755
         d86 |  -.0788971   .0250158    -3.15   0.002    -.1286029   -.0291912
         d87 |  -.0065437   .0252485    -0.26   0.796    -.0567119    .0436246
       _cons |  -1.991916   .5317487    -3.75   0.000     -3.04849   -.9353428
-------------+----------------------------------------------------------------
     sigma_u |  .54852694
     sigma_e |  .16178478
         rho |  .91996996   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. log close
      name:  <unnamed>
       log:  G:\My Drive\Policy_Eval_2019\stata\ch13.log
  log type:  text
 closed on:  19 Mar 2019, 15:16:16
-----------------------------------------------------------------------------------
-----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  G:\My Drive\Policy_Eval_2019\stata\ch13.log
  log type:  text
 opened on:  21 Mar 2019, 13:59:14

. use ** problem Chtp. 14, C1
invalid 'problem' 
r(198);

. ** problem Chpt. 14, C1

. use rental

. ** first estimate by pooled OLS

. reg lrent y90 lpop lavginc pctstu, r

Linear regression                               Number of obs     =        128
                                                F(4, 123)         =     223.25
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8613
                                                Root MSE          =     .12592

------------------------------------------------------------------------------
             |               Robust
       lrent |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         y90 |   .2622267   .0579585     4.52   0.000     .1475015     .376952
        lpop |   .0406864   .0223732     1.82   0.071    -.0035999    .0849727
     lavginc |   .5714459   .0989018     5.78   0.000     .3756758     .767216
      pctstu |   .0050436   .0011488     4.39   0.000     .0027696    .0073176
       _cons |  -.5688066   .8506251    -0.67   0.505    -2.252567    1.114954
------------------------------------------------------------------------------

. sum pctstu

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      pctstu |        128    27.41512    13.75447   9.941273   71.20982

. ** rents were 26% higher in 90 than 80, c.p.

. ** a 10 pct point increase in pctstu is assoc with a 5% increase in rent c.p.

. ** now do with first differences

. reg clrent clpop clavginc cpctstu, r

Linear regression                               Number of obs     =         64
                                                F(3, 60)          =      11.30
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3223
                                                Root MSE          =     .09013

------------------------------------------------------------------------------
             |               Robust
      clrent |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       clpop |   .0722456   .0696796     1.04   0.304    -.0671344    .2116255
    clavginc |   .3099606   .0893099     3.47   0.001     .1313141     .488607
     cpctstu |   .0112033    .002936     3.82   0.000     .0053305    .0170762
       _cons |   .3855214   .0487186     7.91   0.000     .2880697    .4829731
------------------------------------------------------------------------------

. ** now a 10 pct point increase in pctstu is assoc with a 11.2% increase in rent, 
> cp

. ** now FE:

. xtreg lrent y90 lpop lavginc pctstu, i(city) fe r

Fixed-effects (within) regression               Number of obs     =        128
Group variable: city                            Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.9765                                         min =          2
     between = 0.2173                                         avg =        2.0
     overall = 0.7597                                         max =          2

                                                F(4,63)           =     703.09
corr(u_i, Xb)  = -0.1297                        Prob > F          =     0.0000

                                  (Std. Err. adjusted for 64 clusters in city)
------------------------------------------------------------------------------
             |               Robust
       lrent |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         y90 |   .3855214   .0483116     7.98   0.000     .2889784    .4820644
        lpop |   .0722458   .0690979     1.05   0.300    -.0658354    .2103269
     lavginc |   .3099605   .0885636     3.50   0.001     .1329803    .4869406
      pctstu |   .0112033   .0029114     3.85   0.000     .0053853    .0170214
       _cons |   1.409384   1.152609     1.22   0.226    -.8939212    3.712688
-------------+----------------------------------------------------------------
     sigma_u |  .15905859
     sigma_e |  .06372875
         rho |  .86167518   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. log close
      name:  <unnamed>
       log:  G:\My Drive\Policy_Eval_2019\stata\ch13.log
  log type:  text
 closed on:  21 Mar 2019, 14:25:32
-----------------------------------------------------------------------------------
