----------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  G:\My Drive\Policy_Eval_2019\stata\ch15.log
  log type:  text
 opened on:  19 Feb 2019, 11:46:03


      name:  <unnamed>
       log:  G:\My Drive\Policy_Eval_2019\stata\ch15.log
  log type:  text
 opened on:  19 Feb 2019, 15:15:34

. ** do example of how to implement 2sls:

. use card.dta

. ** OLS:

. reg lwage educ exper expersq black smsa south reg662-reg669 smsa66, r

Linear regression                               Number of obs     =      3,010
                                                F(15, 2994)       =      91.31
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2998
                                                Root MSE          =     .37228

------------------------------------------------------------------------------
             |               Robust
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0746932   .0036462    20.48   0.000     .0675438    .0818427
       exper |    .084832   .0067548    12.56   0.000     .0715875    .0980765
     expersq |   -.002287   .0003194    -7.16   0.000    -.0029133   -.0016608
       black |  -.1990123   .0181644   -10.96   0.000    -.2346282   -.1633964
        smsa |   .1363846   .0192172     7.10   0.000     .0987043    .1740649
       south |   -.147955   .0280346    -5.28   0.000     -.202924    -.092986
      reg662 |   .0963671   .0350964     2.75   0.006     .0275517    .1651825
      reg663 |     .14454   .0338217     4.27   0.000      .078224     .210856
      reg664 |   .0550755    .041204     1.34   0.181    -.0257154    .1358665
      reg665 |   .1280248    .042915     2.98   0.003     .0438789    .2121707
      reg666 |   .1405174   .0451252     3.11   0.002     .0520378     .228997
      reg667 |    .117981    .045614     2.59   0.010      .028543     .207419
      reg668 |  -.0564361   .0505995    -1.12   0.265    -.1556494    .0427772
      reg669 |   .1185697   .0387784     3.06   0.002     .0425347    .1946047
      smsa66 |   .0262417   .0185908     1.41   0.158    -.0102103    .0626936
       _cons |   4.620807    .074229    62.25   0.000     4.475262    4.766352
------------------------------------------------------------------------------

. ** Use proximity to a 4 yr collage as IV for educ

. ** first stage of 2sls:

. ** regress the endogenous variable (educ) on the instrument (nearc4) and the other vars:

. reg educ nearc4 exper expersq black smsa south reg662-reg669 smsa66, r

Linear regression                               Number of obs     =      3,010
                                                F(15, 2994)       =     244.92
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4771
                                                Root MSE          =     1.9405

------------------------------------------------------------------------------
             |               Robust
        educ |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      nearc4 |   .3198989   .0850763     3.76   0.000      .153085    .4867128
       exper |  -.4125334   .0320751   -12.86   0.000    -.4754249   -.3496418
     expersq |   .0008686   .0017076     0.51   0.611    -.0024795    .0042167
       black |  -.9355287   .0925281   -10.11   0.000    -1.116954   -.7541037
        smsa |   .4021825   .1112278     3.62   0.000     .1840918    .6202731
       south |  -.0516126   .1419604    -0.36   0.716    -.3299623    .2267371
      reg662 |  -.0786363   .1858739    -0.42   0.672    -.4430898    .2858171
      reg663 |   -.027939   .1793411    -0.16   0.876    -.3795833    .3237053
      reg664 |    .117182   .2075839     0.56   0.572    -.2898395    .5242035
      reg665 |  -.2726165   .2243154    -1.22   0.224    -.7124443    .1672114
      reg666 |  -.3028147   .2367287    -1.28   0.201     -.766982    .1613526
      reg667 |  -.2168177   .2394968    -0.91   0.365    -.6864128    .2527773
      reg668 |   .5238914   .2568717     2.04   0.041     .0202284    1.027554
      reg669 |    .210271   .1993703     1.05   0.292    -.1806456    .6011876
      smsa66 |   .0254805   .1106315     0.23   0.818    -.1914409    .2424019
       _cons |   16.63825   .2153815    77.25   0.000     16.21594    17.06056
------------------------------------------------------------------------------

. ** the coefficient on nearc4 is statistically significant at conventional levles.

. ** this tells us that corr (z,x) ~= 0 satsified, so the identification holds.

. predict edhat
(option xb assumed; fitted values)

. ** second stage : sub edhat in for educ:

. reg lwage educhat exper expersq black smsa south reg662-reg669 smsa66, r
variable educhat not found
r(111);

. reg lwage edhat exper expersq black smsa south reg662-reg669 smsa66, r

Linear regression                               Number of obs     =      3,010
                                                F(15, 2994)       =      52.50
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1947
                                                Root MSE          =     .39926

------------------------------------------------------------------------------
             |               Robust
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       edhat |   .1315036   .0547706     2.40   0.016     .0241118    .2388955
       exper |    .108271    .023544     4.60   0.000      .062107    .1544351
     expersq |  -.0023349   .0003315    -7.04   0.000     -.002985   -.0016849
       black |   -.146776   .0534139    -2.75   0.006    -.2515076   -.0420443
        smsa |   .1118084   .0310313     3.60   0.000     .0509635    .1726533
       south |  -.1446715   .0303133    -4.77   0.000    -.2041085   -.0852345
      reg662 |   .1007677   .0385196     2.62   0.009     .0252402    .1762953
      reg663 |   .1482587   .0364648     4.07   0.000     .0767602    .2197573
      reg664 |   .0498971   .0432343     1.15   0.249    -.0348748     .134669
      reg665 |   .1462718   .0490083     2.98   0.003     .0501785    .2423652
      reg666 |   .1629028   .0527348     3.09   0.002     .0595027     .266303
      reg667 |   .1345721   .0517146     2.60   0.009     .0331723    .2359719
      reg668 |  -.0830769   .0589527    -1.41   0.159    -.1986688    .0325149
      reg669 |   .1078142   .0428782     2.51   0.012     .0237406    .1918879
      smsa66 |   .0185311   .0222388     0.83   0.405    -.0250738     .062136
       _cons |   3.666155   .9214655     3.98   0.000     1.859385    5.472924
------------------------------------------------------------------------------

. ** 13% return w/IV.  Std. errors not valid though, b/c not using formula for
> Variance with IV

. ** to get valid std errors, use stata's command for IV.  Like OLS but put
> instrument and other control variables in parentheses):

. reg lwage educ exper expersq black smsa south reg662-reg669 smsa66 (nearc4 exper 
> expersq black smsa south reg662-reg669 smsa66), r

Instrumental variables (2SLS) regression        Number of obs     =      3,010
                                                F(15, 2994)       =      55.76
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2382
                                                Root MSE          =     .38833

------------------------------------------------------------------------------
             |               Robust
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .1315038   .0541436     2.43   0.015     .0253413    .2376662
       exper |   .1082711   .0234089     4.63   0.000      .062372    .1541701
     expersq |  -.0023349   .0003488    -6.69   0.000    -.0030188   -.0016511
       black |  -.1467758   .0525019    -2.80   0.005    -.2497193   -.0438323
        smsa |   .1118084   .0311448     3.59   0.000     .0507409    .1728758
       south |  -.1446715   .0291429    -4.96   0.000    -.2018136   -.0875294
      reg662 |   .1007677   .0365488     2.76   0.006     .0291044    .1724311
      reg663 |   .1482588   .0355971     4.16   0.000     .0784615     .218056
      reg664 |   .0498971   .0436162     1.14   0.253    -.0356238    .1354179
      reg665 |   .1462719   .0492259     2.97   0.003     .0497519    .2427918
      reg666 |   .1629029   .0517655     3.15   0.002     .0614034    .2644025
      reg667 |   .1345722   .0505567     2.66   0.008     .0354427    .2337017
      reg668 |   -.083077   .0572432    -1.45   0.147     -.195317     .029163
      reg669 |   .1078142   .0410761     2.62   0.009     .0272739    .1883545
      smsa66 |   .0185311   .0205651     0.90   0.368     -.021792    .0588542
       _cons |   3.666152   .9109598     4.02   0.000     1.879981    5.452322
------------------------------------------------------------------------------

. log close
      name:  <unnamed>
       log:  G:\My Drive\Policy_Eval_2019\stata\ch15.log
  log type:  text
 closed on:  19 Feb 2019, 15:20:53
-----------------------------------------------------------------------------------
. ** homework problem Chpt. 15, C1, for your reference

. use wage2.dta

. * i)

. * While you weren't asked to do this, I will begin by estimating the IV model.  First, doing the two stages separately, by hand:

. * First stage:

. reg educ sibs

      Source |       SS           df       MS      Number of obs   =       935
-------------+----------------------------------   F(1, 933)       =     56.67
       Model |  258.055048         1  258.055048   Prob > F        =    0.0000
    Residual |   4248.7642       933  4.55387374   R-squared       =    0.0573
-------------+----------------------------------   Adj R-squared   =    0.0562
       Total |  4506.81925       934  4.82528828   Root MSE        =     2.134

------------------------------------------------------------------------------
        educ |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sibs |  -.2279164   .0302768    -7.53   0.000     -.287335   -.1684979
       _cons |   14.13879   .1131382   124.97   0.000     13.91676    14.36083
------------------------------------------------------------------------------

. predict educhat
(option xb assumed; fitted values)

. * second stage:

. reg lwage educhat

      Source |       SS           df       MS      Number of obs   =       935
-------------+----------------------------------   F(1, 933)       =     22.31
       Model |  3.86818135         1  3.86818135   Prob > F        =    0.0000
    Residual |  161.788113       933  .173406338   R-squared       =    0.0234
-------------+----------------------------------   Adj R-squared   =    0.0223
       Total |  165.656294       934  .177362199   Root MSE        =    .41642

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     educhat |   .1224326   .0259225     4.72   0.000     .0715595    .1733057
       _cons |   5.130026   .3494009    14.68   0.000     4.444323    5.815729
------------------------------------------------------------------------------

. * Now do using stata command for IV, and with robust standard errors:

. reg lwage educ (sibs), r

Instrumental variables (2SLS) regression        Number of obs     =        935
                                                F(1, 933)         =      24.80
                                                Prob > F          =     0.0000
                                                R-squared         =          .
                                                Root MSE          =      .4233

------------------------------------------------------------------------------
             |               Robust
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .1224327   .0245865     4.98   0.000     .0741814    .1706839
       _cons |   5.130026    .330732    15.51   0.000     4.480961    5.779091
------------------------------------------------------------------------------

. ** now do what problem asks and show that this is not the same as just plugging sibs in for educ:

. reg lwage sibs, r

Linear regression                               Number of obs     =        935
                                                F(1, 933)         =      25.43
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0234
                                                Root MSE          =     .41642

------------------------------------------------------------------------------
             |               Robust
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sibs |  -.0279044   .0055332    -5.04   0.000    -.0387634   -.0170454
       _cons |   6.861076   .0218359   314.21   0.000     6.818222    6.903929
------------------------------------------------------------------------------

. * ii) educ and brthord might be negatively correlated if later-born children get fewer resources or less attention.

. reg educ brthord, r

Linear regression                               Number of obs     =        852
                                                F(1, 850)         =      44.36
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0420
                                                Root MSE          =     2.1546

------------------------------------------------------------------------------
             |               Robust
        educ |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     brthord |  -.2826441   .0424383    -6.66   0.000    -.3659403   -.1993479
       _cons |   14.14945   .1280928   110.46   0.000     13.89803    14.40086
------------------------------------------------------------------------------

. ** yes, there is a statistically significant negative correlation.

. * iii) use brthord as IV for education:

. reg lwage educ (brthord), r

Instrumental variables (2SLS) regression        Number of obs     =        852
                                                F(1, 850)         =      17.50
                                                Prob > F          =     0.0000
                                                R-squared         =          .
                                                Root MSE          =     .42151

------------------------------------------------------------------------------
             |               Robust
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .1306448   .0312339     4.18   0.000     .0693401    .1919495
       _cons |   5.030397    .422299    11.91   0.000     4.201526    5.859268
------------------------------------------------------------------------------

. * education increases the wage by 13%

. * iv) The identification assumption is that PI2 is not equal to 0, or that birth order is correlated with education, holding sibs constant

. * test:

. reg educ sibs birthord
variable birthord not found
r(111);

. reg educ sibs brthord

      Source |       SS           df       MS      Number of obs   =       852
-------------+----------------------------------   F(2, 849)       =     26.29
       Model |  240.246365         2  120.123183   Prob > F        =    0.0000
    Residual |  3878.72429       849  4.56857985   R-squared       =    0.0583
-------------+----------------------------------   Adj R-squared   =    0.0561
       Total |  4118.97066       851  4.84015353   Root MSE        =    2.1374

------------------------------------------------------------------------------
        educ |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sibs |  -.1528673   .0398705    -3.83   0.000    -.2311236   -.0746109
     brthord |  -.1526742   .0570764    -2.67   0.008    -.2647017   -.0406467
       _cons |    14.2965   .1332881   107.26   0.000     14.03489    14.55811
------------------------------------------------------------------------------

. * We reject the null that pi2 = 0 at 1% level.

. * v) reg lwage educ sibs (brthord sibs), r

. reg lwage educ sibs (brthord sibs), r

Instrumental variables (2SLS) regression        Number of obs     =        852
                                                F(2, 849)         =      12.37
                                                Prob > F          =     0.0000
                                                R-squared         =          .
                                                Root MSE          =     .42698

------------------------------------------------------------------------------
             |               Robust
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |    .136994   .0767712     1.78   0.075    -.0136895    .2876776
        sibs |   .0021107   .0179741     0.12   0.907    -.0331681    .0373895
       _cons |   4.938529   1.086801     4.54   0.000     2.805398     7.07166
------------------------------------------------------------------------------

. * here, an extra year of education increases the wage by 13.7%, holding sibs constant.  Let's compare this to OLS:

. reg lwage educ sibs, r

Linear regression                               Number of obs     =        935
                                                F(2, 932)         =      54.60
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1039
                                                Root MSE          =      .3991

------------------------------------------------------------------------------
             |               Robust
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0560375   .0062961     8.90   0.000     .0436814    .0683936
        sibs |  -.0151325   .0055187    -2.74   0.006     -.025963   -.0043021
       _cons |   6.068773   .0912823    66.48   0.000      5.88963    6.247916
------------------------------------------------------------------------------

. ** notice that the coefficient is very different.  Under our assumptions, IV is consistent, so IV is closer to the truth in expectation. But the IV stan
> dard errors are much larger.

. * vi) skip

. log close
      name:  <unnamed>
       log:  G:\My Drive\Policy_Eval_2019\stata\ch15.log
  log type:  text
 closed on:  19 Feb 2019, 11:55:45
----------------------------------------------------------------------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------