----------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  G:\My Drive\Policy_Eval_2019\stata\ch2.log
  log type:  text
 opened on:  22 Jan 2019, 14:44:31

. use wage1.dta

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        wage |        526    5.896103    3.693086        .53      24.98
        educ |        526    12.56274    2.769022          0         18
       exper |        526    17.01711    13.57216          1         51
      tenure |        526    5.104563    7.224462          0         44
    nonwhite |        526    .1026616    .3038053          0          1
-------------+---------------------------------------------------------
      female |        526    .4790875     .500038          0          1
     married |        526     .608365    .4885804          0          1
      numdep |        526    1.043726    1.261891          0          6
        smsa |        526    .7224335    .4482246          0          1
    northcen |        526    .2509506    .4339728          0          1
-------------+---------------------------------------------------------
       south |        526    .3555133    .4791242          0          1
        west |        526    .1692015    .3752867          0          1
    construc |        526    .0456274    .2088743          0          1
     ndurman |        526    .1140684     .318197          0          1
    trcommpu |        526    .0437262      .20468          0          1
-------------+---------------------------------------------------------
       trade |        526    .2870722    .4528262          0          1
    services |        526    .1007605    .3012978          0          1
    profserv |        526    .2585551    .4382574          0          1
     profocc |        526    .3669202    .4824233          0          1
     clerocc |        526    .1673004    .3735991          0          1
-------------+---------------------------------------------------------
     servocc |        526    .1406844    .3480267          0          1
       lwage |        526    1.623268    .5315382  -.6348783   3.218076
     expersq |        526    473.4354    616.0448          1       2601
     tenursq |        526    78.15019    199.4347          0       1936

. sum wage

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        wage |        526    5.896103    3.693086        .53      24.98

. desc wage

              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------
wage            float   %9.0g                 average hourly earnings

. desc

Contains data from wage1.dta
  obs:           526                          
 vars:            24                          13 Sep 2000 15:41
 size:        16,832                          
----------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------
wage            float   %9.0g                 average hourly earnings
educ            byte    %9.0g                 years of education
exper           byte    %9.0g                 years potential experience
tenure          byte    %9.0g                 years with current employer
nonwhite        byte    %9.0g                 =1 if nonwhite
female          byte    %9.0g                 =1 if female
married         byte    %9.0g                 =1 if married
numdep          byte    %9.0g                 number of dependents
smsa            byte    %9.0g                 =1 if live in SMSA
northcen        byte    %9.0g                 =1 if live in north central U.S
south           byte    %9.0g                 =1 if live in southern region
west            byte    %9.0g                 =1 if live in western region
construc        byte    %9.0g                 =1 if work in construc. indus.
ndurman         byte    %9.0g                 =1 if in nondur. manuf. indus.
trcommpu        byte    %9.0g                 =1 if in trans, commun, pub ut
trade           byte    %9.0g                 =1 if in wholesale or retail
services        byte    %9.0g                 =1 if in services indus.
profserv        byte    %9.0g                 =1 if in prof. serv. indus.
profocc         byte    %9.0g                 =1 if in profess. occupation
clerocc         byte    %9.0g                 =1 if in clerical occupation
servocc         byte    %9.0g                 =1 if in service occupation
lwage           float   %9.0g                 log(wage)
expersq         int     %9.0g                 exper^2
tenursq         int     %9.0g                 tenure^2
----------------------------------------------------------------------------------------
Sorted by: 

. ** sum is used to summarize, desc defines the variables

. ** test zero conditional mean assumption for wage/tenure/female example

. sum female

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      female |        526    .4790875     .500038          0          1

. sum female if tenure==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      female |         51     .627451    .4882944          0          1

. sum female if tenure==5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      female |         30    .3666667    .4901325          0          1

. sum female if tenure>20

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      female |         33    .1515152    .3641095          0          1

. ** looks like ZCM violated because conditioning on tenure changes the expected value o
> f female

. ** let's run our first regression!

. reg wage tenure

      Source |       SS           df       MS      Number of obs   =       526
-------------+----------------------------------   F(1, 524)       =     71.68
       Model |   861.62965         1   861.62965   Prob > F        =    0.0000
    Residual |  6298.78464       524  12.0205814   R-squared       =    0.1203
-------------+----------------------------------   Adj R-squared   =    0.1187
       Total |  7160.41429       525  13.6388844   Root MSE        =    3.4671

------------------------------------------------------------------------------
        wage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      tenure |   .1773271   .0209449     8.47   0.000     .1361809    .2184733
       _cons |   4.990925    .185158    26.95   0.000     4.627182    5.354669
------------------------------------------------------------------------------

. ** demonstrate sample vs population estimators

. use gpa2.dta

. reg colgpa sat

      Source |       SS           df       MS      Number of obs   =     4,137
-------------+----------------------------------   F(1, 4135)      =    829.26
       Model |  299.712725         1  299.712725   Prob > F        =    0.0000
    Residual |  1494.48295     4,135   .36142272   R-squared       =    0.1670
-------------+----------------------------------   Adj R-squared   =    0.1668
       Total |  1794.19567     4,136  .433799728   Root MSE        =    .60118

------------------------------------------------------------------------------
      colgpa |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         sat |   .0019311   .0000671    28.80   0.000     .0017996    .0020625
       _cons |   .6630568   .0697213     9.51   0.000     .5263656     .799748
------------------------------------------------------------------------------

. ** think of those as pop values

. sample 10
(3,723 observations deleted)

. reg colgpa sat

      Source |       SS           df       MS      Number of obs   =       414
-------------+----------------------------------   F(1, 412)       =     89.11
       Model |  29.2285603         1  29.2285603   Prob > F        =    0.0000
    Residual |  135.133928       412  .327994972   R-squared       =    0.1778
-------------+----------------------------------   Adj R-squared   =    0.1758
       Total |  164.362489       413  .397972128   Root MSE        =    .57271

------------------------------------------------------------------------------
      colgpa |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         sat |   .0020024   .0002121     9.44   0.000     .0015854    .0024194
       _cons |   .6113406   .2185788     2.80   0.005     .1816718    1.041009
------------------------------------------------------------------------------

. use gpa2.dta, clear

. sample 10
(3,723 observations deleted)

. reg colgpa sat

      Source |       SS           df       MS      Number of obs   =       414
-------------+----------------------------------   F(1, 412)       =     58.50
       Model |  23.6550359         1  23.6550359   Prob > F        =    0.0000
    Residual |  166.605919       412  .404383298   R-squared       =    0.1243
-------------+----------------------------------   Adj R-squared   =    0.1222
       Total |  190.260955       413  .460680278   Root MSE        =    .63591

------------------------------------------------------------------------------
      colgpa |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         sat |   .0016415   .0002146     7.65   0.000     .0012196    .0020634
       _cons |   .9670629   .2235873     4.33   0.000     .5275486    1.406577
------------------------------------------------------------------------------

. use gpa2.dta, clear

. sample 10
(3,723 observations deleted)

. reg colgpa sat

      Source |       SS           df       MS      Number of obs   =       414
-------------+----------------------------------   F(1, 412)       =     91.68
       Model |  34.9784595         1  34.9784595   Prob > F        =    0.0000
    Residual |  157.192802       412  .381535926   R-squared       =    0.1820
-------------+----------------------------------   Adj R-squared   =    0.1800
       Total |  192.171261       413  .465305717   Root MSE        =    .61769

------------------------------------------------------------------------------
      colgpa |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         sat |   .0021022   .0002196     9.57   0.000     .0016706    .0025338
       _cons |   .5024073   .2273424     2.21   0.028     .0555115    .9493031
------------------------------------------------------------------------------

. log close
      name:  <unnamed>
       log:  G:\My Drive\Policy_Eval_2019\stata\ch2.log
  log type:  text
 closed on:  22 Jan 2019, 15:25:31
----------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  G:\My Drive\Policy_Eval_2019\stata\ch2.log
  log type:  text
 opened on:  24 Jan 2019, 14:10:47

. ** problem C3

. use sleep.dta
file sleep.dta not found
r(601);

. use sleep75.dta

. desc sleep totwrk

              storage   display    value
variable name   type    format     label      variable label
-----------------------------------------------------------------------------------
sleep           int     %9.0g                  mins sleep at night, per week
totwrk          int     %9.0g                  mins worked per week

. reg sleep totwrk

      Source |       SS           df       MS      Number of obs   =       706
-------------+----------------------------------   F(1, 704)       =     81.09
       Model |  14381717.2         1  14381717.2   Prob > F        =    0.0000
    Residual |   124858119       704  177355.282   R-squared       =    0.1033
-------------+----------------------------------   Adj R-squared   =    0.1020
       Total |   139239836       705  197503.313   Root MSE        =    421.14

------------------------------------------------------------------------------
       sleep |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      totwrk |  -.1507458   .0167403    -9.00   0.000    -.1836126    -.117879
       _cons |   3586.377   38.91243    92.17   0.000     3509.979    3662.775
------------------------------------------------------------------------------

. ** interpreting simple regression

. ** vote share model

. use vote1.dta

. sum voteA shareA

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       voteA |        173    50.50289    16.78476         16         84
      shareA |        173    51.07618    33.48389        .09       99.5

. desc voteA shareA

              storage   display    value
variable name   type    format     label      variable label
-----------------------------------------------------------------------------------
voteA           byte    %9.0g                 percent vote for A
shareA          float   %9.0g                 100*(expendA/(expendA+expendB))

. reg voteA shareA

      Source |       SS           df       MS      Number of obs   =       173
-------------+----------------------------------   F(1, 171)       =   1017.70
       Model |  41486.4749         1  41486.4749   Prob > F        =    0.0000
    Residual |  6970.77363       171  40.7647581   R-squared       =    0.8561
-------------+----------------------------------   Adj R-squared   =    0.8553
       Total |  48457.2486       172  281.728189   Root MSE        =    6.3847

------------------------------------------------------------------------------
       voteA |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      shareA |   .4638239   .0145393    31.90   0.000     .4351243    .4925234
       _cons |   26.81254   .8871887    30.22   0.000     25.06129    28.56379
------------------------------------------------------------------------------

. ** a one percentage point increase in spending share is predicted to increase vot
> e share by .46 percentage points

. ** example 2

. use wage1.dta

. scatter wage educ

. reg wage educ

      Source |       SS           df       MS      Number of obs   =       526
-------------+----------------------------------   F(1, 524)       =    103.36
       Model |  1179.73204         1  1179.73204   Prob > F        =    0.0000
    Residual |  5980.68225       524  11.4135158   R-squared       =    0.1648
-------------+----------------------------------   Adj R-squared   =    0.1632
       Total |  7160.41429       525  13.6388844   Root MSE        =    3.3784

------------------------------------------------------------------------------
        wage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .5413593    .053248    10.17   0.000     .4367534    .6459651
       _cons |  -.9048516   .6849678    -1.32   0.187    -2.250472    .4407687
------------------------------------------------------------------------------

. ** let's CPI inflate these wages from 1976 dollars to 2018 dollars

. gen wage18=wage*4.52

. reg wage18 educ

      Source |       SS           df       MS      Number of obs   =       526
-------------+----------------------------------   F(1, 524)       =    103.36
       Model |  24102.3968         1  24102.3968   Prob > F        =    0.0000
    Residual |  122187.731       524  233.182692   R-squared       =    0.1648
-------------+----------------------------------   Adj R-squared   =    0.1632
       Total |  146290.127       525  278.647862   Root MSE        =     15.27

------------------------------------------------------------------------------
      wage18 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   2.446944   .2406811    10.17   0.000     1.974125    2.919762
       _cons |  -4.089929   3.096055    -1.32   0.187    -10.17213    1.992275
------------------------------------------------------------------------------

. scatter wage educ

. reg lwage educ

      Source |       SS           df       MS      Number of obs   =       526
-------------+----------------------------------   F(1, 524)       =    119.58
       Model |  27.5606296         1  27.5606296   Prob > F        =    0.0000
    Residual |  120.769132       524  .230475443   R-squared       =    0.1858
-------------+----------------------------------   Adj R-squared   =    0.1843
       Total |  148.329762       525   .28253288   Root MSE        =    .48008

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0827444   .0075667    10.94   0.000     .0678796    .0976092
       _cons |   .5837726   .0973358     6.00   0.000     .3925562     .774989
------------------------------------------------------------------------------

. gen lwage18=ln(wage)

. reg lwage18 educ

      Source |       SS           df       MS      Number of obs   =       526
-------------+----------------------------------   F(1, 524)       =    119.58
       Model |  27.5606288         1  27.5606288   Prob > F        =    0.0000
    Residual |  120.769123       524  .230475425   R-squared       =    0.1858
-------------+----------------------------------   Adj R-squared   =    0.1843
       Total |  148.329751       525   .28253286   Root MSE        =    .48008

------------------------------------------------------------------------------
     lwage18 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0827444   .0075667    10.94   0.000     .0678796    .0976091
       _cons |   .5837727   .0973358     6.00   0.000     .3925563    .7749891
------------------------------------------------------------------------------

. log close
      name:  <unnamed>
       log:  G:\My Drive\Policy_Eval_2019\stata\ch2.log
  log type:  text
 closed on:  24 Jan 2019, 15:14:38
-----------------------------------------------------------------------------------
