-----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  G:\My Drive\Policy_Eval_2019\stata\ch3.log
  log type:  text
 opened on:  29 Jan 2019, 14:33:23

. ** demonstrate perfect collinearity

. gen wage18=wage*4.52

. reg educ wage wage18
note: wage omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =       935
-------------+----------------------------------   F(1, 933)       =    111.79
       Model |  482.230092         1  482.230092   Prob > F        =    0.0000
    Residual |  4024.58916       933  4.31360039   R-squared       =    0.1070
-------------+----------------------------------   Adj R-squared   =    0.1060
       Total |  4506.81925       934  4.82528828   Root MSE        =    2.0769

------------------------------------------------------------------------------
        educ |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        wage |          0  (omitted)
      wage18 |   .0003931   .0000372    10.57   0.000     .0003202    .0004661
       _cons |   11.76619   .1747386    67.34   0.000     11.42326    12.10912
------------------------------------------------------------------------------

. ** comparison of simple and multiple regression

. use affairs.dta
no; data in memory would be lost
r(4);

. use affairs.dta, clear

. sum affair kids

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      affair |        601     .249584    .4331328          0          1
        kids |        601    .7154742    .4515641          0          1

. ** start w/simple:

. reg affair kids

      Source |       SS           df       MS      Number of obs   =       601
-------------+----------------------------------   F(1, 599)       =     10.89
       Model |  2.00927483         1  2.00927483   Prob > F        =    0.0010
    Residual |  110.553121       599  .184562807   R-squared       =    0.0179
-------------+----------------------------------   Adj R-squared   =    0.0162
       Total |  112.562396       600  .187603993   Root MSE        =    .42961

------------------------------------------------------------------------------
      affair |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        kids |   .1281518   .0388398     3.30   0.001      .051873    .2044305
       _cons |   .1578947   .0328529     4.81   0.000     .0933738    .2224157
------------------------------------------------------------------------------

. reg affair kids id

      Source |       SS           df       MS      Number of obs   =       601
-------------+----------------------------------   F(2, 598)       =      5.64
       Model |  2.08272075         2  1.04136038   Prob > F        =    0.0038
    Residual |  110.479675       598  .184748621   R-squared       =    0.0185
-------------+----------------------------------   Adj R-squared   =    0.0152
       Total |  112.562396       600  .187603993   Root MSE        =    .42982

------------------------------------------------------------------------------
      affair |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        kids |   .1290924    .038888     3.32   0.001     .0527188     .205466
          id |  -.0000121   .0000192    -0.63   0.529    -.0000498    .0000256
       _cons |   .1700464    .038103     4.46   0.000     .0952145    .2448782
------------------------------------------------------------------------------

. ** kids coefficient stays same b/c b2-hat is zero

. reg affair kids slghtrel

      Source |       SS           df       MS      Number of obs   =       601
-------------+----------------------------------   F(2, 598)       =      8.51
       Model |  3.11552112         2  1.55776056   Prob > F        =    0.0002
    Residual |  109.446875       598   .18302153   R-squared       =    0.0277
-------------+----------------------------------   Adj R-squared   =    0.0244
       Total |  112.562396       600  .187603993   Root MSE        =    .42781

------------------------------------------------------------------------------
      affair |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        kids |   .1266964   .0386818     3.28   0.001     .0507276    .2026651
    slghtrel |   .1045077   .0425083     2.46   0.014      .021024    .1879913
       _cons |   .1365043   .0338526     4.03   0.000     .0700198    .2029888
------------------------------------------------------------------------------

. reg slghtrel kids

      Source |       SS           df       MS      Number of obs   =       601
-------------+----------------------------------   F(1, 599)       =      0.14
       Model |  .023727986         1  .023727986   Prob > F        =    0.7081
    Residual |   101.28742       599   .16909419   R-squared       =    0.0002
-------------+----------------------------------   Adj R-squared   =   -0.0014
       Total |  101.311148       600  .168851913   Root MSE        =    .41121

------------------------------------------------------------------------------
    slghtrel |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        kids |   .0139263   .0371766     0.37   0.708     -.059086    .0869385
       _cons |   .2046784   .0314461     6.51   0.000     .1429204    .2664363
------------------------------------------------------------------------------

. ** here, kids and slghtrel are not correlated, so no change in coefficient on kid
> s

. reg affair kids yrsmarr

      Source |       SS           df       MS      Number of obs   =       601
-------------+----------------------------------   F(2, 598)       =      7.32
       Model |  2.69049824         2  1.34524912   Prob > F        =    0.0007
    Residual |  109.871898       598  .183732271   R-squared       =    0.0239
-------------+----------------------------------   Adj R-squared   =    0.0206
       Total |  112.562396       600  .187603993   Root MSE        =    .42864

------------------------------------------------------------------------------
      affair |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        kids |   .0760005   .0472788     1.61   0.108    -.0168522    .1688532
     yrsmarr |   .0073787    .003832     1.93   0.055    -.0001472    .0149046
       _cons |   .1348667   .0348924     3.87   0.000     .0663401    .2033933
------------------------------------------------------------------------------

. reg yrsmarr kids

      Source |       SS           df       MS      Number of obs   =       601
-------------+----------------------------------   F(1, 599)       =    292.59
       Model |  6111.64094         1  6111.64094   Prob > F        =    0.0000
    Residual |  12512.0103       599  20.8881642   R-squared       =    0.3282
-------------+----------------------------------   Adj R-squared   =    0.3270
       Total |  18623.6513       600  31.0394188   Root MSE        =    4.5704

------------------------------------------------------------------------------
     yrsmarr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        kids |   7.067794    .413195    17.11   0.000     6.256307    7.879281
       _cons |   3.120871   .3495039     8.93   0.000     2.434469    3.807273
------------------------------------------------------------------------------

. ** coeff changed because yrsmarr correlated with kids and is a determinant of aff
> air

. reg affair kids male age yrsmarr relig educ ratemarr

      Source |       SS           df       MS      Number of obs   =       601
-------------+----------------------------------   F(7, 593)       =     10.07
       Model |  11.9563695         7  1.70805279   Prob > F        =    0.0000
    Residual |  100.606026       593  .169656031   R-squared       =    0.1062
-------------+----------------------------------   Adj R-squared   =    0.0957
       Total |  112.562396       600  .187603993   Root MSE        =    .41189

------------------------------------------------------------------------------
      affair |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        kids |    .050184   .0458106     1.10   0.274    -.0397867    .1401547
        male |   .0517169   .0378123     1.37   0.172    -.0225453    .1259792
         age |  -.0073149   .0030033    -2.44   0.015    -.0132134   -.0014165
     yrsmarr |   .0160812   .0054836     2.93   0.003     .0053116    .0268508
       relig |  -.0539739   .0148614    -3.63   0.000    -.0831613   -.0247866
        educ |    .004867   .0077506     0.63   0.530     -.010355    .0200891
    ratemarr |   -.087728   .0159642    -5.50   0.000    -.1190813   -.0563747
       _cons |    .729658   .1508556     4.84   0.000     .4333817    1.025934
------------------------------------------------------------------------------

. reg affair kids male age relig educ ratemarr

      Source |       SS           df       MS      Number of obs   =       601
-------------+----------------------------------   F(6, 594)       =     10.18
       Model |  10.4972831         6  1.74954719   Prob > F        =    0.0000
    Residual |  102.065113       594  .171826789   R-squared       =    0.0933
-------------+----------------------------------   Adj R-squared   =    0.0841
       Total |  112.562396       600  .187603993   Root MSE        =    .41452

------------------------------------------------------------------------------
      affair |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        kids |   .1068199   .0418057     2.56   0.011     .0247149     .188925
        male |   .0303162    .037338     0.81   0.417    -.0430144    .1036468
         age |  -.0009928   .0021043    -0.47   0.637    -.0051256    .0031401
       relig |  -.0495895   .0148803    -3.33   0.001    -.0788139   -.0203651
        educ |   .0052485    .007799     0.67   0.501    -.0100684    .0205654
    ratemarr |  -.0926055   .0159786    -5.80   0.000    -.1239869   -.0612241
       _cons |   .6247819   .1474901     4.24   0.000     .3351165    .9144474
------------------------------------------------------------------------------

. log close
      name:  <unnamed>
       log:  G:\My Drive\Policy_Eval_2019\stata\ch3.log
  log type:  text
 closed on:  29 Jan 2019, 15:16:49
-----------------------------------------------------------------------------------
