-----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  G:\My Drive\Policy_Eval_2019\stata\ch4.log
  log type:  text
 opened on:  31 Jan 2019, 15:14:33

. use gpa2.dta

. reg colgpa sat

      Source |       SS           df       MS      Number of obs   =     4,137
-------------+----------------------------------   F(1, 4135)      =    829.26
       Model |  299.712725         1  299.712725   Prob > F        =    0.0000
    Residual |  1494.48295     4,135   .36142272   R-squared       =    0.1670
-------------+----------------------------------   Adj R-squared   =    0.1668
       Total |  1794.19567     4,136  .433799728   Root MSE        =    .60118

------------------------------------------------------------------------------
      colgpa |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         sat |   .0019311   .0000671    28.80   0.000     .0017996    .0020625
       _cons |   .6630568   .0697213     9.51   0.000     .5263656     .799748
------------------------------------------------------------------------------

. log close
      name:  <unnamed>
       log:  G:\My Drive\Policy_Eval_2019\stata\ch4.log
  log type:  text
 closed on:  31 Jan 2019, 15:16:11
-----------------------------------------------------------------------------------
--------------------------------------------------------------------------
      name:  <unnamed>
       log:  G:\My Drive\Policy_Eval_2019\stata\ch4.log
  log type:  text
 opened on:   5 Feb 2019, 13:59:25

. reg colgpa hsize
no variables defined
r(111);

. use gpa2.dta

. reg colgpa hsize

      Source |       SS           df       MS      Number of obs   =     4
> ,137
-------------+----------------------------------   F(1, 4135)      =      
> 3.38
       Model |  1.46338995         1  1.46338995   Prob > F        =    0.
> 0662
    Residual |  1792.73228     4,135  .433550734   R-squared       =    0.
> 0008
-------------+----------------------------------   Adj R-squared   =    0.
> 0006
       Total |  1794.19567     4,136  .433799728   Root MSE        =    .6
> 5845

--------------------------------------------------------------------------
> ----
      colgpa |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Inter
> val]
-------------+------------------------------------------------------------
> ----
       hsize |  -.0108317   .0058957    -1.84   0.066    -.0223904    .000
> 7271
       _cons |   2.683011   .0194231   138.13   0.000     2.644931    2.72
> 1091
--------------------------------------------------------------------------
> ----

. desc hsize

              storage   display    value
variable name   type    format     label      variable label
-----------------------------------------------------------------------------------
hsize           double  %10.0g                size grad. class, 100s

. ** we reject the null that b1=0 at 10% level, fail to reject at 5% for a two-side
> d test

. reg colgpa athlete hsrank

      Source |       SS           df       MS      Number of obs   =     4,137
-------------+----------------------------------   F(2, 4134)      =    264.12
       Model |   203.28598         2   101.64299   Prob > F        =    0.0000
    Residual |  1590.90969     4,134  .384835436   R-squared       =    0.1133
-------------+----------------------------------   Adj R-squared   =    0.1129
       Total |  1794.19567     4,136  .433799728   Root MSE        =    .62035

------------------------------------------------------------------------------
      colgpa |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     athlete |  -.0913512   .0464495    -1.97   0.049    -.1824171   -.0002853
      hsrank |  -.0033587   .0001518   -22.12   0.000    -.0036564    -.003061
       _cons |   2.834411   .0124716   227.27   0.000      2.80996    2.858862
------------------------------------------------------------------------------

. use affairs.dta

. by male: sum affair
not sorted
r(5);

. sort male

. by male: sum affair

-----------------------------------------------------------------------------------
-> male = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      affair |        315    .2285714    .4205806          0          1

-----------------------------------------------------------------------------------
-> male = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      affair |        286    .2727273    .4461424          0          1


. sum affair if male==0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      affair |        315    .2285714    .4205806          0          1

. sum affair if male==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      affair |        286    .2727273    .4461424          0          1

. ** use regression to do t-test

. reg affair male

      Source |       SS           df       MS      Number of obs   =       601
-------------+----------------------------------   F(1, 599)       =      1.56
       Model |  .292266137         1  .292266137   Prob > F        =    0.2122
    Residual |   112.27013       599  .187429265   R-squared       =    0.0026
-------------+----------------------------------   Adj R-squared   =    0.0009
       Total |  112.562396       600  .187603993   Root MSE        =    .43293

------------------------------------------------------------------------------
      affair |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0441558   .0353604     1.25   0.212    -.0252897    .1136013
       _cons |   .2285714   .0243929     9.37   0.000     .1806654    .2764774
------------------------------------------------------------------------------

. ** fail to reject the null that the means are the same at 5%, 10%, 20%

. use mlb.dta
file mlb.dta not found
r(601);

. use mlb1.dta

. reg lsalary years gamesyr bavg hrunsyr rbisyr

      Source |       SS           df       MS      Number of obs   =       353
-------------+----------------------------------   F(5, 347)       =    117.06
       Model |    308.9892         5    61.79784   Prob > F        =    0.0000
    Residual |  183.186335       347   .52791451   R-squared       =    0.6278
-------------+----------------------------------   Adj R-squared   =    0.6224
       Total |  492.175535       352  1.39822595   Root MSE        =    .72658

------------------------------------------------------------------------------
     lsalary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       years |   .0688626   .0121145     5.68   0.000     .0450355    .0926898
     gamesyr |   .0125521   .0026468     4.74   0.000     .0073464    .0177578
        bavg |   .0009786   .0011035     0.89   0.376    -.0011918     .003149
     hrunsyr |   .0144295    .016057     0.90   0.369    -.0171518    .0460107
      rbisyr |   .0107657    .007175     1.50   0.134    -.0033462    .0248776
       _cons |   11.19242   .2888229    38.75   0.000     10.62435    11.76048
------------------------------------------------------------------------------

. ** that was the unrestricted model for H0: b3=b4=b5=0

. ** now estimate restricted model

. reg lsalary years gamesyr

      Source |       SS           df       MS      Number of obs   =       353
-------------+----------------------------------   F(2, 350)       =    259.32
       Model |  293.864044         2  146.932022   Prob > F        =    0.0000
    Residual |  198.311491       350  .566604259   R-squared       =    0.5971
-------------+----------------------------------   Adj R-squared   =    0.5948
       Total |  492.175535       352  1.39822595   Root MSE        =    .75273

------------------------------------------------------------------------------
     lsalary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       years |    .071318    .012505     5.70   0.000     .0467236    .0959124
     gamesyr |   .0201745   .0013429    15.02   0.000     .0175334    .0228156
       _cons |    11.2238    .108312   103.62   0.000     11.01078    11.43683
------------------------------------------------------------------------------

. ** reject the null at 1% level

. ** get stata to do f-test for us:

. ** estimate unrestricted model

. reg lsalary years gamesyr bavg hrunsyr rbisyr

      Source |       SS           df       MS      Number of obs   =       353
-------------+----------------------------------   F(5, 347)       =    117.06
       Model |    308.9892         5    61.79784   Prob > F        =    0.0000
    Residual |  183.186335       347   .52791451   R-squared       =    0.6278
-------------+----------------------------------   Adj R-squared   =    0.6224
       Total |  492.175535       352  1.39822595   Root MSE        =    .72658

------------------------------------------------------------------------------
     lsalary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       years |   .0688626   .0121145     5.68   0.000     .0450355    .0926898
     gamesyr |   .0125521   .0026468     4.74   0.000     .0073464    .0177578
        bavg |   .0009786   .0011035     0.89   0.376    -.0011918     .003149
     hrunsyr |   .0144295    .016057     0.90   0.369    -.0171518    .0460107
      rbisyr |   .0107657    .007175     1.50   0.134    -.0033462    .0248776
       _cons |   11.19242   .2888229    38.75   0.000     10.62435    11.76048
------------------------------------------------------------------------------

. test bavg hrunsyr rbisyr

 ( 1)  bavg = 0
 ( 2)  hrunsyr = 0
 ( 3)  rbisyr = 0

       F(  3,   347) =    9.55
            Prob > F =    0.0000

. reg lsalary nl pcinc

      Source |       SS           df       MS      Number of obs   =       353
-------------+----------------------------------   F(2, 350)       =      1.20
       Model |  3.36399631         2  1.68199815   Prob > F        =    0.3011
    Residual |  488.811539       350   1.3966044   R-squared       =    0.0068
-------------+----------------------------------   Adj R-squared   =    0.0012
       Total |  492.175535       352  1.39822595   Root MSE        =    1.1818

------------------------------------------------------------------------------
     lsalary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          nl |  -.1281217   .1262161    -1.02   0.311    -.3763592    .1201157
       pcinc |   .0000244   .0000221     1.11   0.270     -.000019    .0000678
       _cons |   13.09368   .4286163    30.55   0.000     12.25069    13.93667
------------------------------------------------------------------------------

. reg lsalary years gamesyr bavg hrunsyr rbisyr if shortstop==1
shortstop not found
r(111);

. reg lsalary years gamesyr bavg hrunsyr rbisyr if shrtstop==1

      Source |       SS           df       MS      Number of obs   =        49
-------------+----------------------------------   F(5, 43)        =     17.79
       Model |  42.4532075         5   8.4906415   Prob > F        =    0.0000
    Residual |  20.5199126        43   .47720727   R-squared       =    0.6741
-------------+----------------------------------   Adj R-squared   =    0.6363
       Total |  62.9731201        48     1.31194   Root MSE        =     .6908

------------------------------------------------------------------------------
     lsalary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       years |   .0488342   .0310361     1.57   0.123    -.0137561    .1114245
     gamesyr |   .0204161   .0078911     2.59   0.013      .004502    .0363301
        bavg |   .0003294   .0051669     0.06   0.949    -.0100906    .0107494
     hrunsyr |   .0693948   .0620383     1.12   0.270    -.0557174    .1945069
      rbisyr |  -.0086087   .0255674    -0.34   0.738    -.0601702    .0429527
       _cons |   11.06602   1.207559     9.16   0.000     8.630745     13.5013
------------------------------------------------------------------------------

. test bavg hrunsyr rbisyr

 ( 1)  bavg = 0
 ( 2)  hrunsyr = 0
 ( 3)  rbisyr = 0

       F(  3,    43) =    1.25
            Prob > F =    0.3018

. reg lsalary years gamesyr bavg hrunsyr rbisyr if outfield==1

      Source |       SS           df       MS      Number of obs   =       136
-------------+----------------------------------   F(5, 130)       =     42.72
       Model |  122.173089         5  24.4346178   Prob > F        =    0.0000
    Residual |  74.3537888       130  .571952221   R-squared       =    0.6217
-------------+----------------------------------   Adj R-squared   =    0.6071
       Total |  196.526878       135  1.45575465   Root MSE        =    .75628

------------------------------------------------------------------------------
     lsalary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       years |   .0314159   .0214169     1.47   0.145    -.0109549    .0737867
     gamesyr |   .0142199   .0044599     3.19   0.002     .0053964    .0230434
        bavg |   .0029865   .0029648     1.01   0.316     -.002879    .0088521
     hrunsyr |   .0038857   .0281309     0.14   0.890    -.0517679    .0595392
      rbisyr |   .0134001   .0119235     1.12   0.263    -.0101891    .0369892
       _cons |    10.7735   .6657958    16.18   0.000     9.456306     12.0907
------------------------------------------------------------------------------

. test bavg hrunsyr rbisyr

 ( 1)  bavg = 0
 ( 2)  hrunsyr = 0
 ( 3)  rbisyr = 0

       F(  3,   130) =    3.28
            Prob > F =    0.0230

. use hprice1.dta

. reg lprice lassess colonial

      Source |       SS           df       MS      Number of obs   =        88
-------------+----------------------------------   F(2, 85)        =    144.58
       Model |  6.19618982         2  3.09809491   Prob > F        =    0.0000
    Residual |   1.8214137        85  .021428396   R-squared       =    0.7728
-------------+----------------------------------   Adj R-squared   =    0.7675
       Total |  8.01760352        87  .092156362   Root MSE        =    .14638

------------------------------------------------------------------------------
      lprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lassess |    1.00254   .0602405    16.64   0.000     .8827655    1.122314
    colonial |   .0558441   .0340433     1.64   0.105    -.0118431    .1235312
       _cons |  -.1380458   .3430186    -0.40   0.688    -.8200587     .543967
------------------------------------------------------------------------------

. ** that's unrestricted model

. test lassess==1

 ( 1)  lassess = 1

       F(  1,    85) =    0.00
            Prob > F =    0.9665

. test colonial==0, accum

 ( 1)  lassess = 1
 ( 2)  colonial = 0

       F(  2,    85) =    1.37
            Prob > F =    0.2595

. log close
      name:  <unnamed>
       log:  G:\My Drive\Policy_Eval_2019\stata\ch4.log
  log type:  text
 closed on:   5 Feb 2019, 15:17:09
-----------------------------------------------------------------------------------
-----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  G:\My Drive\Policy_Eval_2019\stata\ch4.log
  log type:  text
 opened on:   7 Feb 2019, 13:56:22

. ** Chpt 4 C2

. use lawsch85

. reg lsalary LSAT GPA llibvol lcost rank

      Source |       SS           df       MS      Number of obs   =       136
-------------+----------------------------------   F(5, 130)       =    138.23
       Model |  8.73363382         5  1.74672676   Prob > F        =    0.0000
    Residual |  1.64272884       130  .012636376   R-squared       =    0.8417
-------------+----------------------------------   Adj R-squared   =    0.8356
       Total |  10.3763627       135  .076861946   Root MSE        =    .11241

------------------------------------------------------------------------------
     lsalary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        LSAT |   .0046964   .0040105     1.17   0.244    -.0032379    .0126307
         GPA |   .2475245    .090037     2.75   0.007      .069397    .4256519
     llibvol |   .0949925   .0332543     2.86   0.005     .0292028    .1607823
       lcost |   .0375543   .0321061     1.17   0.244    -.0259637    .1010723
        rank |  -.0033246   .0003485    -9.54   0.000     -.004014   -.0026352
       _cons |   8.343234   .5325191    15.67   0.000     7.289709    9.396759
------------------------------------------------------------------------------

. test LSAT GPA

 ( 1)  LSAT = 0
 ( 2)  GPA = 0

       F(  2,   130) =    9.95
            Prob > F =    0.0001

. ** that would be unrestricted model

. ** restricted:

. reg lsalary llibvol lcost rank

      Source |       SS           df       MS      Number of obs   =       141
-------------+----------------------------------   F(3, 137)       =    211.04
       Model |  8.82249886         3  2.94083295   Prob > F        =    0.0000
    Residual |  1.90907805       137  .013934876   R-squared       =    0.8221
-------------+----------------------------------   Adj R-squared   =    0.8182
       Total |  10.7315769       140  .076654121   Root MSE        =    .11805

------------------------------------------------------------------------------
     lsalary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     llibvol |   .1291499   .0325187     3.97   0.000     .0648463    .1934535
       lcost |    .026513   .0295489     0.90   0.371     -.031918    .0849439
        rank |  -.0041713   .0002976   -14.02   0.000    -.0047596   -.0035829
       _cons |   9.880135   .3433112    28.78   0.000      9.20126    10.55901
------------------------------------------------------------------------------

. ** limit sample to ones where LSAT & GPA observed:

. reg lsalary llibvol lcost rank if LSAT~=. & GPA~=.

      Source |       SS           df       MS      Number of obs   =       136
-------------+----------------------------------   F(3, 132)       =    197.03
       Model |  8.48212636         3  2.82737545   Prob > F        =    0.0000
    Residual |   1.8942363       132  .014350275   R-squared       =    0.8174
-------------+----------------------------------   Adj R-squared   =    0.8133
       Total |  10.3763627       135  .076861946   Root MSE        =    .11979

------------------------------------------------------------------------------
     lsalary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     llibvol |   .1299038   .0341238     3.81   0.000     .0624036     .197404
       lcost |    .023708   .0304724     0.78   0.438    -.0365694    .0839855
        rank |  -.0041779     .00031   -13.48   0.000    -.0047911   -.0035647
       _cons |   9.903842   .3591253    27.58   0.000     9.193457    10.61423
------------------------------------------------------------------------------

. reg lsalary LSAT GPA llibvol lcost rank clsize faculty

      Source |       SS           df       MS      Number of obs   =       131
-------------+----------------------------------   F(7, 123)       =     95.05
       Model |  8.51021399         7  1.21574486   Prob > F        =    0.0000
    Residual |  1.57316175       123  .012789933   R-squared       =    0.8440
-------------+----------------------------------   Adj R-squared   =    0.8351
       Total |  10.0833757       130  .077564429   Root MSE        =    .11309

------------------------------------------------------------------------------
     lsalary |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        LSAT |   .0055823   .0041798     1.34   0.184    -.0026914     .013856
         GPA |   .2660674   .0932495     2.85   0.005     .0814857    .4506491
     llibvol |   .0551573   .0404005     1.37   0.175     -.024813    .1351275
       lcost |   .0296721    .034683     0.86   0.394    -.0389809    .0983251
        rank |  -.0034277   .0003573    -9.59   0.000    -.0041349   -.0027204
      clsize |   .0001342   .0001535     0.87   0.384    -.0001697     .000438
     faculty |   .0000675   .0003999     0.17   0.866    -.0007242    .0008591
       _cons |   8.415906    .552253    15.24   0.000     7.322755    9.509057
------------------------------------------------------------------------------

. test clsize faculty

 ( 1)  clsize = 0
 ( 2)  faculty = 0

       F(  2,   123) =    0.95
            Prob > F =    0.3902

. log close
      name:  <unnamed>
       log:  G:\My Drive\Policy_Eval_2019\stata\ch4.log
  log type:  text
 closed on:   7 Feb 2019, 14:24:57
-----------------------------------------------------------------------------------
