-----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  G:\My Drive\Policy_Eval_2019\stata\ch6.log
  log type:  text
 opened on:  12 Feb 2019, 14:46:12

. reg wage educ exper expersq

      Source |       SS           df       MS      Number of obs   =       526
-------------+----------------------------------   F(3, 522)       =     64.11
       Model |  1927.87673         3  642.625576   Prob > F        =    0.0000
    Residual |  5232.53756       522  10.0240183   R-squared       =    0.2692
-------------+----------------------------------   Adj R-squared   =    0.2650
       Total |  7160.41429       525  13.6388844   Root MSE        =    3.1661

------------------------------------------------------------------------------
        wage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .5953429   .0530251    11.23   0.000     .4911741    .6995118
       exper |    .268287   .0368969     7.27   0.000     .1958023    .3407717
     expersq |  -.0046123    .000822    -5.61   0.000     -.006227   -.0029975
       _cons |   -3.96489   .7521526    -5.27   0.000    -5.442508   -2.487272
------------------------------------------------------------------------------

. ** predict fitted values

. predict yhat
(option xb assumed; fitted values)

. scatter yhat exper

. log close
      name:  <unnamed>
       log:  G:\My Drive\Policy_Eval_2019\stata\ch6.log
  log type:  text
 closed on:  12 Feb 2019, 15:18:50
-----------------------------------------------------------------------------------
-----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  G:\My Drive\Policy_Eval_2019\stata\ch6.log
  log type:  text
 opened on:  14 Feb 2019, 13:57:30

. use bwght2.dta

. reg lbwght npvis npvissq

      Source |       SS           df       MS      Number of obs   =     1,764
-------------+----------------------------------   F(2, 1761)      =     19.12
       Model |   1.5771321         2  .788566048   Prob > F        =    0.0000
    Residual |  72.6282777     1,761  .041242634   R-squared       =    0.0213
-------------+----------------------------------   Adj R-squared   =    0.0201
       Total |  74.2054098     1,763   .04209042   Root MSE        =    .20308

------------------------------------------------------------------------------
      lbwght |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       npvis |   .0189167   .0036806     5.14   0.000     .0116979    .0261355
     npvissq |  -.0004288     .00012    -3.57   0.000    -.0006641   -.0001934
       _cons |   7.957883   .0273125   291.36   0.000     7.904314    8.011451
------------------------------------------------------------------------------

. predict lbwthat
(option xb assumed; fitted values)
(68 missing values generated)

. scatter lbwthat npvis

.  count if npvis>22
  87

. ** add age (this is problem C10 in Chpt 6)

. reg lbwght npvis npvissq mage magesq

      Source |       SS           df       MS      Number of obs   =     1,764
-------------+----------------------------------   F(4, 1759)      =     11.56
       Model |  1.90136387         4  .475340968   Prob > F        =    0.0000
    Residual |  72.3040459     1,759    .0411052   R-squared       =    0.0256
-------------+----------------------------------   Adj R-squared   =    0.0234
       Total |  74.2054098     1,763   .04209042   Root MSE        =    .20274

------------------------------------------------------------------------------
      lbwght |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       npvis |   .0180374   .0037086     4.86   0.000     .0107636    .0253112
     npvissq |  -.0004079   .0001204    -3.39   0.001    -.0006441   -.0001717
        mage |    .025392   .0092542     2.74   0.006     .0072417    .0435423
      magesq |  -.0004119   .0001548    -2.66   0.008    -.0007154   -.0001083
       _cons |   7.583713   .1370568    55.33   0.000     7.314901    7.852524
------------------------------------------------------------------------------

. disp .025/(2*.0004)
31.25

. reg bwght npvis npvissq mage magesq

      Source |       SS           df       MS      Number of obs   =     1,764
-------------+----------------------------------   F(4, 1759)      =      8.59
       Model |  11376019.1         4  2844004.78   Prob > F        =    0.0000
    Residual |   582383777     1,759  331087.992   R-squared       =    0.0192
-------------+----------------------------------   Adj R-squared   =    0.0169
       Total |   593759796     1,763  336789.448   Root MSE        =     575.4

------------------------------------------------------------------------------
       bwght |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       npvis |   37.47386   10.52531     3.56   0.000     16.83042     58.1173
     npvissq |  -.7862864   .3417884    -2.30   0.022     -1.45664   -.1159322
        mage |   81.60554   26.26395     3.11   0.002     30.09369    133.1174
      magesq |  -1.327179   .4392829    -3.02   0.003     -2.18875   -.4656073
       _cons |   1860.381    388.977     4.78   0.000     1097.475    2623.286
------------------------------------------------------------------------------

. scatter lbwght npvis

. log close
      name:  <unnamed>
       log:  G:\My Drive\Policy_Eval_2019\stata\ch6.log
  log type:  text
 closed on:  14 Feb 2019, 14:41:55
-----------------------------------------------------------------------------------
